[
  {
    "id": 1,
    "content": "One thing was certain, that the white kitten had had nothing to do with\n      it:—it was the black kitten’s fault entirely. For the white kitten\n      had been having its face washed by the old cat for the last quarter of an\n      hour (and bearing it pretty well, considering); so you see that it\n      couldn’t have had any hand in the mischief."
  },
  {
    "id": 2,
    "content": "The way Dinah washed her children’s faces was this: first she held the\n      poor thing down by its ear with one paw, and then with the other paw she\n      rubbed its face all over, the wrong way, beginning at the nose: and just\n      now, as I said, she was hard at work on the white kitten, which was lying\n      quite still and trying to purr—no doubt feeling that it was all\n      meant for its good."
  },
  {
    "id": 3,
    "content": "But the black kitten had been finished with earlier in the afternoon, and\n      so, while Alice was sitting curled up in a corner of the great arm-chair,\n      half talking to herself and half asleep, the kitten had been having a\n      grand game of romps with the ball of worsted Alice had been trying to wind\n      up, and had been rolling it up and down till it had all come undone again;\n      and there it was, spread over the hearth-rug, all knots and tangles, with\n      the kitten running after its own tail in the middle."
  },
  {
    "id": 4,
    "content": "‘Oh, you wicked little thing!’ cried Alice, catching up the kitten, and\n      giving it a little kiss to make it understand that it was in disgrace.\n      ‘Really, Dinah ought to have taught you better manners! You ought, Dinah,\n      you know you ought!’ she added, looking reproachfully at the old cat, and\n      speaking in as cross a voice as she could manage—and then she\n      scrambled back into the arm-chair, taking the kitten and the worsted with\n      her, and began winding up the ball again. But she didn’t get on very fast,\n      as she was talking all the time, sometimes to the kitten, and sometimes to\n      herself. Kitty sat very demurely on her knee, pretending to watch the\n      progress of the winding, and now and then putting out one paw and gently\n      touching the ball, as if it would be glad to help, if it might."
  },
  {
    "id": 5,
    "content": "‘Do you know what to-morrow is, Kitty?’ Alice began. ‘You’d have guessed\n      if you’d been up in the window with me—only Dinah was making you\n      tidy, so you couldn’t. I was watching the boys getting in sticks for the\n      bonfire—and it wants plenty of sticks, Kitty! Only it got so cold,\n      and it snowed so, they had to leave off. Never mind, Kitty, we’ll go and\n      see the bonfire to-morrow.’ Here Alice wound two or three turns of the\n      worsted round the kitten’s neck, just to see how it would look: this led\n      to a scramble, in which the ball rolled down upon the floor, and yards and\n      yards of it got unwound again."
  },
  {
    "id": 6,
    "content": "‘Do you know, I was so angry, Kitty,’ Alice went on as soon as they were\n      comfortably settled again, ‘when I saw all the mischief you had been\n      doing, I was very nearly opening the window, and putting you out into the\n      snow! And you’d have deserved it, you little mischievous darling! What\n      have you got to say for yourself? Now don’t interrupt me!’ she went on,\n      holding up one finger. ‘I’m going to tell you all your faults. Number one:\n      you squeaked twice while Dinah was washing your face this morning. Now you\n      can’t deny it, Kitty: I heard you! What’s that you say?’ (pretending that\n      the kitten was speaking.) ‘Her paw went into your eye? Well, that’s your\n      fault, for keeping your eyes open—if you’d shut them tight up, it\n      wouldn’t have happened. Now don’t make any more excuses, but listen!\n      Number two: you pulled Snowdrop away by the tail just as I had put down\n      the saucer of milk before her! What, you were thirsty, were you? How do\n      you know she wasn’t thirsty too? Now for number three: you unwound every\n      bit of the worsted while I wasn’t looking!"
  },
  {
    "id": 7,
    "content": "‘That’s three faults, Kitty, and you’ve not been punished for any of them\n      yet. You know I’m saving up all your punishments for Wednesday week—Suppose\n      they had saved up all my punishments!’ she went on, talking more to\n      herself than the kitten. ‘What would they do at the end of a year? I\n      should be sent to prison, I suppose, when the day came. Or—let me\n      see—suppose each punishment was to be going without a dinner: then,\n      when the miserable day came, I should have to go without fifty dinners at\n      once! Well, I shouldn’t mind that much! I’d far rather go without them\n      than eat them!"
  },
  {
    "id": 8,
    "content": "‘Do you hear the snow against the window-panes, Kitty? How nice and soft\n      it sounds! Just as if some one was kissing the window all over outside. I\n      wonder if the snow loves the trees and fields, that it kisses them so\n      gently? And then it covers them up snug, you know, with a white quilt; and\n      perhaps it says, “Go to sleep, darlings, till the summer comes again.” And\n      when they wake up in the summer, Kitty, they dress themselves all in\n      green, and dance about—whenever the wind blows—oh, that’s very\n      pretty!’ cried Alice, dropping the ball of worsted to clap her hands. ‘And\n      I do so wish it was true! I’m sure the woods look sleepy in the autumn,\n      when the leaves are getting brown."
  },
  {
    "id": 9,
    "content": "‘Kitty, can you play chess? Now, don’t smile, my dear, I’m asking it\n      seriously. Because, when we were playing just now, you watched just as if\n      you understood it: and when I said “Check!” you purred! Well, it was a\n      nice check, Kitty, and really I might have won, if it hadn’t been for that\n      nasty Knight, that came wiggling down among my pieces. Kitty, dear, let’s\n      pretend—’ And here I wish I could tell you half the things Alice\n      used to say, beginning with her favourite phrase ‘Let’s pretend.’ She had\n      had quite a long argument with her sister only the day before—all\n      because Alice had begun with ‘Let’s pretend we’re kings and queens;’ and\n      her sister, who liked being very exact, had argued that they couldn’t,\n      because there were only two of them, and Alice had been reduced at last to\n      say, ‘Well, you can be one of them then, and I’ll be all the rest.’ And\n      once she had really frightened her old nurse by shouting suddenly in her\n      ear, ‘Nurse! Do let’s pretend that I’m a hungry hyaena, and you’re a\n      bone.’"
  },
  {
    "id": 10,
    "content": "But this is taking us away from Alice’s speech to the kitten. ‘Let’s\n      pretend that you’re the Red Queen, Kitty! Do you know, I think if you sat\n      up and folded your arms, you’d look exactly like her. Now do try, there’s\n      a dear!’ And Alice got the Red Queen off the table, and set it up before\n      the kitten as a model for it to imitate: however, the thing didn’t\n      succeed, principally, Alice said, because the kitten wouldn’t fold its\n      arms properly. So, to punish it, she held it up to the Looking-glass, that\n      it might see how sulky it was—‘and if you’re not good directly,’ she\n      added, ‘I’ll put you through into Looking-glass House. How would you like\n      that?’"
  },
  {
    "id": 11,
    "content": "‘Now, if you’ll only attend, Kitty, and not talk so much, I’ll tell you\n      all my ideas about Looking-glass House. First, there’s the room you can\n      see through the glass—that’s just the same as our drawing room, only\n      the things go the other way. I can see all of it when I get upon a chair—all\n      but the bit behind the fireplace. Oh! I do so wish I could see that bit! I\n      want so much to know whether they’ve a fire in the winter: you never can\n      tell, you know, unless our fire smokes, and then smoke comes up in that\n      room too—but that may be only pretence, just to make it look as if\n      they had a fire. Well then, the books are something like our books, only\n      the words go the wrong way; I know that, because I’ve held up one of our\n      books to the glass, and then they hold up one in the other room."
  },
  {
    "id": 12,
    "content": "‘How would you like to live in Looking-glass House, Kitty? I wonder if\n      they’d give you milk in there? Perhaps Looking-glass milk isn’t good to\n      drink—But oh, Kitty! now we come to the passage. You can just see a\n      little peep of the passage in Looking-glass House, if you leave the door\n      of our drawing-room wide open: and it’s very like our passage as far as\n      you can see, only you know it may be quite different on beyond. Oh, Kitty!\n      how nice it would be if we could only get through into Looking-glass\n      House! I’m sure it’s got, oh! such beautiful things in it! Let’s pretend\n      there’s a way of getting through into it, somehow, Kitty. Let’s pretend\n      the glass has got all soft like gauze, so that we can get through. Why,\n      it’s turning into a sort of mist now, I declare! It’ll be easy enough to\n      get through—’ She was up on the chimney-piece while she said this,\n      though she hardly knew how she had got there. And certainly the glass was\n      beginning to melt away, just like a bright silvery mist."
  },
  {
    "id": 13,
    "content": "In another moment Alice was through the glass, and had jumped lightly down\n      into the Looking-glass room. The very first thing she did was to look\n      whether there was a fire in the fireplace, and she was quite pleased to\n      find that there was a real one, blazing away as brightly as the one she\n      had left behind. ‘So I shall be as warm here as I was in the old room,’\n      thought Alice: ‘warmer, in fact, because there’ll be no one here to scold\n      me away from the fire. Oh, what fun it’ll be, when they see me through the\n      glass in here, and can’t get at me!’"
  },
  {
    "id": 14,
    "content": "Then she began looking about, and noticed that what could be seen from the\n      old room was quite common and uninteresting, but that all the rest was as\n      different as possible. For instance, the pictures on the wall next the\n      fire seemed to be all alive, and the very clock on the chimney-piece (you\n      know you can only see the back of it in the Looking-glass) had got the\n      face of a little old man, and grinned at her."
  },
  {
    "id": 15,
    "content": "‘They don’t keep this room so tidy as the other,’ Alice thought to\n      herself, as she noticed several of the chessmen down in the hearth among\n      the cinders: but in another moment, with a little ‘Oh!’ of surprise, she\n      was down on her hands and knees watching them. The chessmen were walking\n      about, two and two!"
  },
  {
    "id": 16,
    "content": "‘Here are the Red King and the Red Queen,’ Alice said (in a whisper, for\n      fear of frightening them), ‘and there are the White King and the White\n      Queen sitting on the edge of the shovel—and here are two castles\n      walking arm in arm—I don’t think they can hear me,’ she went on, as\n      she put her head closer down, ‘and I’m nearly sure they can’t see me. I\n      feel somehow as if I were invisible—’"
  },
  {
    "id": 17,
    "content": "Here something began squeaking on the table behind Alice, and made her\n      turn her head just in time to see one of the White Pawns roll over and\n      begin kicking: she watched it with great curiosity to see what would\n      happen next."
  },
  {
    "id": 18,
    "content": "‘It is the voice of my child!’ the White Queen cried out as she rushed\n      past the King, so violently that she knocked him over among the cinders.\n      ‘My precious Lily! My imperial kitten!’ and she began scrambling wildly up\n      the side of the fender."
  },
  {
    "id": 19,
    "content": "‘Imperial fiddlestick!’ said the King, rubbing his nose, which had been\n      hurt by the fall. He had a right to be a little annoyed with the Queen,\n      for he was covered with ashes from head to foot."
  },
  {
    "id": 20,
    "content": "Alice was very anxious to be of use, and, as the poor little Lily was\n      nearly screaming herself into a fit, she hastily picked up the Queen and\n      set her on the table by the side of her noisy little daughter."
  },
  {
    "id": 21,
    "content": "The Queen gasped, and sat down: the rapid journey through the air had\n      quite taken away her breath and for a minute or two she could do nothing\n      but hug the little Lily in silence. As soon as she had recovered her\n      breath a little, she called out to the White King, who was sitting sulkily\n      among the ashes, ‘Mind the volcano!’"
  },
  {
    "id": 22,
    "content": "‘What volcano?’ said the King, looking up anxiously into the fire, as if\n      he thought that was the most likely place to find one."
  },
  {
    "id": 23,
    "content": "‘Blew—me—up,’ panted the Queen, who was still a little out of\n      breath. ‘Mind you come up—the regular way—don’t get blown up!’"
  },
  {
    "id": 24,
    "content": "Alice watched the White King as he slowly struggled up from bar to bar,\n      till at last she said, ‘Why, you’ll be hours and hours getting to the\n      table, at that rate. I’d far better help you, hadn’t I?’ But the King took\n      no notice of the question: it was quite clear that he could neither hear\n      her nor see her."
  },
  {
    "id": 25,
    "content": "So Alice picked him up very gently, and lifted him across more slowly than\n      she had lifted the Queen, that she mightn’t take his breath away: but,\n      before she put him on the table, she thought she might as well dust him a\n      little, he was so covered with ashes."
  },
  {
    "id": 26,
    "content": "She said afterwards that she had never seen in all her life such a face as\n      the King made, when he found himself held in the air by an invisible hand,\n      and being dusted: he was far too much astonished to cry out, but his eyes\n      and his mouth went on getting larger and larger, and rounder and rounder,\n      till her hand shook so with laughing that she nearly let him drop upon the\n      floor."
  },
  {
    "id": 27,
    "content": "‘Oh! please don’t make such faces, my dear!’ she cried out, quite\n      forgetting that the King couldn’t hear her. ‘You make me laugh so that I\n      can hardly hold you! And don’t keep your mouth so wide open! All the ashes\n      will get into it—there, now I think you’re tidy enough!’ she added,\n      as she smoothed his hair, and set him upon the table near the Queen."
  },
  {
    "id": 28,
    "content": "The King immediately fell flat on his back, and lay perfectly still: and\n      Alice was a little alarmed at what she had done, and went round the room\n      to see if she could find any water to throw over him. However, she could\n      find nothing but a bottle of ink, and when she got back with it she found\n      he had recovered, and he and the Queen were talking together in a\n      frightened whisper—so low, that Alice could hardly hear what they\n      said."
  },
  {
    "id": 29,
    "content": "The King was saying, ‘I assure, you my dear, I turned cold to the very\n      ends of my whiskers!’"
  },
  {
    "id": 30,
    "content": "To which the Queen replied, ‘You haven’t got any whiskers.’"
  },
  {
    "id": 31,
    "content": "‘The horror of that moment,’ the King went on, ‘I shall never, never\n      forget!’"
  },
  {
    "id": 32,
    "content": "‘You will, though,’ the Queen said, ‘if you don’t make a memorandum of\n      it.’"
  },
  {
    "id": 33,
    "content": "Alice looked on with great interest as the King took an enormous\n      memorandum-book out of his pocket, and began writing. A sudden thought\n      struck her, and she took hold of the end of the pencil, which came some\n      way over his shoulder, and began writing for him."
  },
  {
    "id": 34,
    "content": "The poor King looked puzzled and unhappy, and struggled with the pencil\n      for some time without saying anything; but Alice was too strong for him,\n      and at last he panted out, ‘My dear! I really must get a thinner pencil. I\n      can’t manage this one a bit; it writes all manner of things that I don’t\n      intend—’"
  },
  {
    "id": 35,
    "content": "‘What manner of things?’ said the Queen, looking over the book (in which\n      Alice had put ‘The White Knight is sliding down the poker. He balances\n      very badly’) ‘That’s not a memorandum of your feelings!’"
  },
  {
    "id": 36,
    "content": "There was a book lying near Alice on the table, and while she sat watching\n      the White King (for she was still a little anxious about him, and had the\n      ink all ready to throw over him, in case he fainted again), she turned\n      over the leaves, to find some part that she could read, ‘—for it’s\n      all in some language I don’t know,’ she said to herself."
  },
  {
    "id": 37,
    "content": "It was like this."
  },
  {
    "id": 38,
    "content": "She puzzled over this for some time, but at last a bright thought struck\n      her. ‘Why, it’s a Looking-glass book, of course! And if I hold it up to a\n      glass, the words will all go the right way again.’"
  },
  {
    "id": 39,
    "content": "This was the poem that Alice read."
  },
  {
    "id": 40,
    "content": "‘It seems very pretty,’ she said when she had finished it, ‘but it’s\n      rather hard to understand!’ (You see she didn’t like to confess, ever to\n      herself, that she couldn’t make it out at all.) ‘Somehow it seems to fill\n      my head with ideas—only I don’t exactly know what they are! However,\n      somebody killed something: that’s clear, at any rate—’"
  },
  {
    "id": 41,
    "content": "‘But oh!’ thought Alice, suddenly jumping up, ‘if I don’t make haste I\n      shall have to go back through the Looking-glass, before I’ve seen what the\n      rest of the house is like! Let’s have a look at the garden first!’ She was\n      out of the room in a moment, and ran down stairs—or, at least, it\n      wasn’t exactly running, but a new invention of hers for getting down\n      stairs quickly and easily, as Alice said to herself. She just kept the\n      tips of her fingers on the hand-rail, and floated gently down without even\n      touching the stairs with her feet; then she floated on through the hall,\n      and would have gone straight out at the door in the same way, if she\n      hadn’t caught hold of the door-post. She was getting a little giddy with\n      so much floating in the air, and was rather glad to find herself walking\n      again in the natural way."
  },
  {
    "id": 42,
    "content": "‘I should see the garden far better,’ said Alice to herself, ‘if I could\n      get to the top of that hill: and here’s a path that leads straight to it—at\n      least, no, it doesn’t do that—’ (after going a few yards along the\n      path, and turning several sharp corners), ‘but I suppose it will at last.\n      But how curiously it twists! It’s more like a corkscrew than a path! Well,\n      this turn goes to the hill, I suppose—no, it doesn’t! This goes\n      straight back to the house! Well then, I’ll try it the other way.’"
  },
  {
    "id": 43,
    "content": "And so she did: wandering up and down, and trying turn after turn, but\n      always coming back to the house, do what she would. Indeed, once, when she\n      turned a corner rather more quickly than usual, she ran against it before\n      she could stop herself."
  },
  {
    "id": 44,
    "content": "‘It’s no use talking about it,’ Alice said, looking up at the house and\n      pretending it was arguing with her. ‘I’m not going in again yet. I know I\n      should have to get through the Looking-glass again—back into the old\n      room—and there’d be an end of all my adventures!’"
  },
  {
    "id": 45,
    "content": "So, resolutely turning her back upon the house, she set out once more down\n      the path, determined to keep straight on till she got to the hill. For a\n      few minutes all went on well, and she was just saying, ‘I really shall do\n      it this time—’ when the path gave a sudden twist and shook itself\n      (as she described it afterwards), and the next moment she found herself\n      actually walking in at the door."
  },
  {
    "id": 46,
    "content": "‘Oh, it’s too bad!’ she cried. ‘I never saw such a house for getting in\n      the way! Never!’"
  },
  {
    "id": 47,
    "content": "However, there was the hill full in sight, so there was nothing to be done\n      but start again. This time she came upon a large flower-bed, with a border\n      of daisies, and a willow-tree growing in the middle."
  },
  {
    "id": 48,
    "content": "‘O Tiger-lily,’ said Alice, addressing herself to one that was waving\n      gracefully about in the wind, ‘I wish you could talk!’"
  },
  {
    "id": 49,
    "content": "‘We can talk,’ said the Tiger-lily: ‘when there’s anybody worth talking\n      to.’"
  },
  {
    "id": 50,
    "content": "Alice was so astonished that she could not speak for a minute: it quite\n      seemed to take her breath away. At length, as the Tiger-lily only went on\n      waving about, she spoke again, in a timid voice—almost in a whisper.\n      ‘And can all the flowers talk?’"
  },
  {
    "id": 51,
    "content": "‘As well as you can,’ said the Tiger-lily. ‘And a great deal louder.’"
  },
  {
    "id": 52,
    "content": "‘It isn’t manners for us to begin, you know,’ said the Rose, ‘and I really\n      was wondering when you’d speak! Said I to myself, “Her face has got some\n      sense in it, though it’s not a clever one!” Still, you’re the right\n      colour, and that goes a long way.’"
  },
  {
    "id": 53,
    "content": "‘I don’t care about the colour,’ the Tiger-lily remarked. ‘If only her\n      petals curled up a little more, she’d be all right.’"
  },
  {
    "id": 54,
    "content": "Alice didn’t like being criticised, so she began asking questions. ‘Aren’t\n      you sometimes frightened at being planted out here, with nobody to take\n      care of you?’"
  },
  {
    "id": 55,
    "content": "‘There’s the tree in the middle,’ said the Rose: ‘what else is it good\n      for?’"
  },
  {
    "id": 56,
    "content": "‘But what could it do, if any danger came?’ Alice asked."
  },
  {
    "id": 57,
    "content": "‘It says “Bough-wough!”’ cried a Daisy: ‘that’s why its branches are\n      called boughs!’"
  },
  {
    "id": 58,
    "content": "‘Didn’t you know that?’ cried another Daisy, and here they all began\n      shouting together, till the air seemed quite full of little shrill voices.\n      ‘Silence, every one of you!’ cried the Tiger-lily, waving itself\n      passionately from side to side, and trembling with excitement. ‘They know\n      I can’t get at them!’ it panted, bending its quivering head towards Alice,\n      ‘or they wouldn’t dare to do it!’"
  },
  {
    "id": 59,
    "content": "‘Never mind!’ Alice said in a soothing tone, and stooping down to the\n      daisies, who were just beginning again, she whispered, ‘If you don’t hold\n      your tongues, I’ll pick you!’"
  },
  {
    "id": 60,
    "content": "There was silence in a moment, and several of the pink daisies turned\n      white."
  },
  {
    "id": 61,
    "content": "‘That’s right!’ said the Tiger-lily. ‘The daisies are worst of all. When\n      one speaks, they all begin together, and it’s enough to make one wither to\n      hear the way they go on!’"
  },
  {
    "id": 62,
    "content": "‘How is it you can all talk so nicely?’ Alice said, hoping to get it into\n      a better temper by a compliment. ‘I’ve been in many gardens before, but\n      none of the flowers could talk.’"
  },
  {
    "id": 63,
    "content": "‘Put your hand down, and feel the ground,’ said the Tiger-lily. ‘Then\n      you’ll know why.’"
  },
  {
    "id": 64,
    "content": "Alice did so. ‘It’s very hard,’ she said, ‘but I don’t see what that has\n      to do with it.’"
  },
  {
    "id": 65,
    "content": "‘In most gardens,’ the Tiger-lily said, ‘they make the beds too soft—so\n      that the flowers are always asleep.’"
  },
  {
    "id": 66,
    "content": "This sounded a very good reason, and Alice was quite pleased to know it.\n      ‘I never thought of that before!’ she said."
  },
  {
    "id": 67,
    "content": "‘It’s my opinion that you never think at all,’ the Rose said in a rather\n      severe tone."
  },
  {
    "id": 68,
    "content": "‘I never saw anybody that looked stupider,’ a Violet said, so suddenly,\n      that Alice quite jumped; for it hadn’t spoken before."
  },
  {
    "id": 69,
    "content": "‘Hold your tongue!’ cried the Tiger-lily. ‘As if you ever saw anybody! You\n      keep your head under the leaves, and snore away there, till you know no\n      more what’s going on in the world, than if you were a bud!’"
  },
  {
    "id": 70,
    "content": "‘Are there any more people in the garden besides me?’ Alice said, not\n      choosing to notice the Rose’s last remark."
  },
  {
    "id": 71,
    "content": "‘There’s one other flower in the garden that can move about like you,’\n      said the Rose. ‘I wonder how you do it—’ (‘You’re always wondering,’\n      said the Tiger-lily), ‘but she’s more bushy than you are.’"
  },
  {
    "id": 72,
    "content": "‘Is she like me?’ Alice asked eagerly, for the thought crossed her mind,\n      ‘There’s another little girl in the garden, somewhere!’"
  },
  {
    "id": 73,
    "content": "‘Well, she has the same awkward shape as you,’ the Rose said, ‘but she’s\n      redder—and her petals are shorter, I think.’"
  },
  {
    "id": 74,
    "content": "‘Her petals are done up close, almost like a dahlia,’ the Tiger-lily\n      interrupted: ‘not tumbled about anyhow, like yours.’"
  },
  {
    "id": 75,
    "content": "‘But that’s not your fault,’ the Rose added kindly: ‘you’re beginning to\n      fade, you know—and then one can’t help one’s petals getting a little\n      untidy.’"
  },
  {
    "id": 76,
    "content": "Alice didn’t like this idea at all: so, to change the subject, she asked\n      ‘Does she ever come out here?’"
  },
  {
    "id": 77,
    "content": "‘I daresay you’ll see her soon,’ said the Rose. ‘She’s one of the thorny\n      kind.’"
  },
  {
    "id": 78,
    "content": "‘Where does she wear the thorns?’ Alice asked with some curiosity."
  },
  {
    "id": 79,
    "content": "‘Why all round her head, of course,’ the Rose replied. ‘I was wondering\n      you hadn’t got some too. I thought it was the regular rule.’"
  },
  {
    "id": 80,
    "content": "‘She’s coming!’ cried the Larkspur. ‘I hear her footstep, thump, thump,\n      thump, along the gravel-walk!’"
  },
  {
    "id": 81,
    "content": "Alice looked round eagerly, and found that it was the Red Queen. ‘She’s\n      grown a good deal!’ was her first remark. She had indeed: when Alice first\n      found her in the ashes, she had been only three inches high—and here\n      she was, half a head taller than Alice herself!"
  },
  {
    "id": 82,
    "content": "‘It’s the fresh air that does it,’ said the Rose: ‘wonderfully fine air it\n      is, out here.’"
  },
  {
    "id": 83,
    "content": "‘I think I’ll go and meet her,’ said Alice, for, though the flowers were\n      interesting enough, she felt that it would be far grander to have a talk\n      with a real Queen."
  },
  {
    "id": 84,
    "content": "‘You can’t possibly do that,’ said the Rose: ‘I should advise you\n      to walk the other way.’"
  },
  {
    "id": 85,
    "content": "This sounded nonsense to Alice, so she said nothing, but set off at once\n      towards the Red Queen. To her surprise, she lost sight of her in a moment,\n      and found herself walking in at the front-door again."
  },
  {
    "id": 86,
    "content": "A little provoked, she drew back, and after looking everywhere for the\n      queen (whom she spied out at last, a long way off), she thought she would\n      try the plan, this time, of walking in the opposite direction."
  },
  {
    "id": 87,
    "content": "It succeeded beautifully. She had not been walking a minute before she\n      found herself face to face with the Red Queen, and full in sight of the\n      hill she had been so long aiming at."
  },
  {
    "id": 88,
    "content": "‘Where do you come from?’ said the Red Queen. ‘And where are you going?\n      Look up, speak nicely, and don’t twiddle your fingers all the time.’"
  },
  {
    "id": 89,
    "content": "Alice attended to all these directions, and explained, as well as she\n      could, that she had lost her way."
  },
  {
    "id": 90,
    "content": "‘I don’t know what you mean by your way,’ said the Queen: ‘all the ways\n      about here belong to me—but why did you come out here at all?’ she\n      added in a kinder tone. ‘Curtsey while you’re thinking what to say, it\n      saves time.’"
  },
  {
    "id": 91,
    "content": "Alice wondered a little at this, but she was too much in awe of the Queen\n      to disbelieve it. ‘I’ll try it when I go home,’ she thought to herself,\n      ‘the next time I’m a little late for dinner.’"
  },
  {
    "id": 92,
    "content": "‘It’s time for you to answer now,’ the Queen said, looking at her watch:\n      ‘open your mouth a little wider when you speak, and always say “your\n      Majesty.”’"
  },
  {
    "id": 93,
    "content": "‘I only wanted to see what the garden was like, your Majesty—’"
  },
  {
    "id": 94,
    "content": "‘That’s right,’ said the Queen, patting her on the head, which Alice\n      didn’t like at all, ‘though, when you say “garden,”—I’ve seen\n      gardens, compared with which this would be a wilderness.’"
  },
  {
    "id": 95,
    "content": "Alice didn’t dare to argue the point, but went on: ‘—and I thought\n      I’d try and find my way to the top of that hill—’"
  },
  {
    "id": 96,
    "content": "‘When you say “hill,”’ the Queen interrupted, ‘I could show you\n      hills, in comparison with which you’d call that a valley.’"
  },
  {
    "id": 97,
    "content": "‘No, I shouldn’t,’ said Alice, surprised into contradicting her at last:\n      ‘a hill can’t be a valley, you know. That would be nonsense—’"
  },
  {
    "id": 98,
    "content": "The Red Queen shook her head, ‘You may call it “nonsense” if you like,’\n      she said, ‘but I’ve heard nonsense, compared with which that would be as\n      sensible as a dictionary!’"
  },
  {
    "id": 99,
    "content": "Alice curtseyed again, as she was afraid from the Queen’s tone that she\n      was a little offended: and they walked on in silence till they got to the\n      top of the little hill."
  },
  {
    "id": 100,
    "content": "For some minutes Alice stood without speaking, looking out in all\n      directions over the country—and a most curious country it was. There\n      were a number of tiny little brooks running straight across it from side\n      to side, and the ground between was divided up into squares by a number of\n      little green hedges, that reached from brook to brook."
  },
  {
    "id": 101,
    "content": "‘I declare it’s marked out just like a large chessboard!’ Alice said at\n      last. ‘There ought to be some men moving about somewhere—and so\n      there are!’ She added in a tone of delight, and her heart began to beat\n      quick with excitement as she went on. ‘It’s a great huge game of chess\n      that’s being played—all over the world—if this is the world at\n      all, you know. Oh, what fun it is! How I wish I was one of them! I\n      wouldn’t mind being a Pawn, if only I might join—though of course I\n      should like to be a Queen, best.’"
  },
  {
    "id": 102,
    "content": "She glanced rather shyly at the real Queen as she said this, but her\n      companion only smiled pleasantly, and said, ‘That’s easily managed. You\n      can be the White Queen’s Pawn, if you like, as Lily’s too young to play;\n      and you’re in the Second Square to begin with: when you get to the Eighth\n      Square you’ll be a Queen—’ Just at this moment, somehow or other,\n      they began to run."
  },
  {
    "id": 103,
    "content": "Alice never could quite make out, in thinking it over afterwards, how it\n      was that they began: all she remembers is, that they were running hand in\n      hand, and the Queen went so fast that it was all she could do to keep up\n      with her: and still the Queen kept crying ‘Faster! Faster!’ but Alice felt\n      she could not go faster, though she had not breath left to say so."
  },
  {
    "id": 104,
    "content": "The most curious part of the thing was, that the trees and the other\n      things round them never changed their places at all: however fast they\n      went, they never seemed to pass anything. ‘I wonder if all the things move\n      along with us?’ thought poor puzzled Alice. And the Queen seemed to guess\n      her thoughts, for she cried, ‘Faster! Don’t try to talk!’"
  },
  {
    "id": 105,
    "content": "Not that Alice had any idea of doing that. She felt as if she would never\n      be able to talk again, she was getting so much out of breath: and still\n      the Queen cried ‘Faster! Faster!’ and dragged her along. ‘Are we nearly\n      there?’ Alice managed to pant out at last."
  },
  {
    "id": 106,
    "content": "‘Nearly there!’ the Queen repeated. ‘Why, we passed it ten minutes ago!\n      Faster!’ And they ran on for a time in silence, with the wind whistling in\n      Alice’s ears, and almost blowing her hair off her head, she fancied."
  },
  {
    "id": 107,
    "content": "‘Now! Now!’ cried the Queen. ‘Faster! Faster!’ And they went so fast that\n      at last they seemed to skim through the air, hardly touching the ground\n      with their feet, till suddenly, just as Alice was getting quite exhausted,\n      they stopped, and she found herself sitting on the ground, breathless and\n      giddy."
  },
  {
    "id": 108,
    "content": "The Queen propped her up against a tree, and said kindly, ‘You may rest a\n      little now.’"
  },
  {
    "id": 109,
    "content": "Alice looked round her in great surprise. ‘Why, I do believe we’ve been\n      under this tree the whole time! Everything’s just as it was!’"
  },
  {
    "id": 110,
    "content": "‘Of course it is,’ said the Queen, ‘what would you have it?’"
  },
  {
    "id": 111,
    "content": "‘Well, in our country,’ said Alice, still panting a little, ‘you’d\n      generally get to somewhere else—if you ran very fast for a long\n      time, as we’ve been doing.’"
  },
  {
    "id": 112,
    "content": "‘A slow sort of country!’ said the Queen. ‘Now, here, you see, it takes\n      all the running you can do, to keep in the same place. If you want to get\n      somewhere else, you must run at least twice as fast as that!’"
  },
  {
    "id": 113,
    "content": "‘I’d rather not try, please!’ said Alice. ‘I’m quite content to stay here—only\n      I am so hot and thirsty!’"
  },
  {
    "id": 114,
    "content": "‘I know what you’d like!’ the Queen said good-naturedly, taking a little\n      box out of her pocket. ‘Have a biscuit?’"
  },
  {
    "id": 115,
    "content": "Alice thought it would not be civil to say ‘No,’ though it wasn’t at all\n      what she wanted. So she took it, and ate it as well as she could: and it\n      was very dry; and she thought she had never been so nearly choked in all\n      her life."
  },
  {
    "id": 116,
    "content": "‘While you’re refreshing yourself,’ said the Queen, ‘I’ll just take the\n      measurements.’ And she took a ribbon out of her pocket, marked in inches,\n      and began measuring the ground, and sticking little pegs in here and\n      there."
  },
  {
    "id": 117,
    "content": "‘At the end of two yards,’ she said, putting in a peg to mark the\n      distance, ‘I shall give you your directions—have another biscuit?’"
  },
  {
    "id": 118,
    "content": "‘No, thank you,’ said Alice: ‘one’s quite enough!’"
  },
  {
    "id": 119,
    "content": "‘Thirst quenched, I hope?’ said the Queen."
  },
  {
    "id": 120,
    "content": "Alice did not know what to say to this, but luckily the Queen did not wait\n      for an answer, but went on. ‘At the end of three yards I shall repeat them—for\n      fear of your forgetting them. At the end of four, I shall say good-bye.\n      And at the end of five, I shall go!’"
  },
  {
    "id": 121,
    "content": "She had got all the pegs put in by this time, and Alice looked on with\n      great interest as she returned to the tree, and then began slowly walking\n      down the row."
  },
  {
    "id": 122,
    "content": "At the two-yard peg she faced round, and said, ‘A pawn goes two squares in\n      its first move, you know. So you’ll go very quickly through the Third\n      Square—by railway, I should think—and you’ll find yourself in\n      the Fourth Square in no time. Well, that square belongs to Tweedledum and\n      Tweedledee—the Fifth is mostly water—the Sixth belongs to\n      Humpty Dumpty—But you make no remark?’"
  },
  {
    "id": 123,
    "content": "‘I—I didn’t know I had to make one—just then,’ Alice faltered\n      out."
  },
  {
    "id": 124,
    "content": "‘You should have said, “It’s extremely kind of you to tell me all this”—however,\n      we’ll suppose it said—the Seventh Square is all forest—however,\n      one of the Knights will show you the way—and in the Eighth Square we\n      shall be Queens together, and it’s all feasting and fun!’ Alice got up and\n      curtseyed, and sat down again."
  },
  {
    "id": 125,
    "content": "At the next peg the Queen turned again, and this time she said, ‘Speak in\n      French when you can’t think of the English for a thing—turn out your\n      toes as you walk—and remember who you are!’ She did not wait for\n      Alice to curtsey this time, but walked on quickly to the next peg, where\n      she turned for a moment to say ‘good-bye,’ and then hurried on to the\n      last."
  },
  {
    "id": 126,
    "content": "How it happened, Alice never knew, but exactly as she came to the last\n      peg, she was gone. Whether she vanished into the air, or whether she ran\n      quickly into the wood (‘and she can run very fast!’ thought Alice), there\n      was no way of guessing, but she was gone, and Alice began to remember that\n      she was a Pawn, and that it would soon be time for her to move."
  },
  {
    "id": 127,
    "content": "Of course the first thing to do was to make a grand survey of the country\n      she was going to travel through. ‘It’s something very like learning\n      geography,’ thought Alice, as she stood on tiptoe in hopes of being able\n      to see a little further. ‘Principal rivers—there are none. Principal\n      mountains—I’m on the only one, but I don’t think it’s got any name.\n      Principal towns—why, what are those creatures, making honey down\n      there? They can’t be bees—nobody ever saw bees a mile off, you know—’\n      and for some time she stood silent, watching one of them that was bustling\n      about among the flowers, poking its proboscis into them, ‘just as if it\n      was a regular bee,’ thought Alice."
  },
  {
    "id": 128,
    "content": "However, this was anything but a regular bee: in fact it was an elephant—as\n      Alice soon found out, though the idea quite took her breath away at first.\n      ‘And what enormous flowers they must be!’ was her next idea. ‘Something\n      like cottages with the roofs taken off, and stalks put to them—and\n      what quantities of honey they must make! I think I’ll go down and—no,\n      I won’t just yet,’ she went on, checking herself just as she was beginning\n      to run down the hill, and trying to find some excuse for turning shy so\n      suddenly. ‘It’ll never do to go down among them without a good long branch\n      to brush them away—and what fun it’ll be when they ask me how I like\n      my walk. I shall say—“Oh, I like it well enough—“’ (here came\n      the favourite little toss of the head), ‘“only it was so dusty and hot,\n      and the elephants did tease so!”’"
  },
  {
    "id": 129,
    "content": "‘I think I’ll go down the other way,’ she said after a pause: ‘and perhaps\n      I may visit the elephants later on. Besides, I do so want to get into the\n      Third Square!’"
  },
  {
    "id": 130,
    "content": "So with this excuse she ran down the hill and jumped over the first of the\n      six little brooks."
  },
  {
    "id": 131,
    "content": "‘Tickets, please!’ said the Guard, putting his head in at the window. In a\n      moment everybody was holding out a ticket: they were about the same size\n      as the people, and quite seemed to fill the carriage."
  },
  {
    "id": 132,
    "content": "‘Now then! Show your ticket, child!’ the Guard went on, looking angrily at\n      Alice. And a great many voices all said together (‘like the chorus of a\n      song,’ thought Alice), ‘Don’t keep him waiting, child! Why, his time is\n      worth a thousand pounds a minute!’"
  },
  {
    "id": 133,
    "content": "‘I’m afraid I haven’t got one,’ Alice said in a frightened tone: ‘there\n      wasn’t a ticket-office where I came from.’ And again the chorus of voices\n      went on. ‘There wasn’t room for one where she came from. The land there is\n      worth a thousand pounds an inch!’"
  },
  {
    "id": 134,
    "content": "‘Don’t make excuses,’ said the Guard: ‘you should have bought one from the\n      engine-driver.’ And once more the chorus of voices went on with ‘The man\n      that drives the engine. Why, the smoke alone is worth a thousand pounds a\n      puff!’"
  },
  {
    "id": 135,
    "content": "Alice thought to herself, ‘Then there’s no use in speaking.’ The voices\n      didn’t join in this time, as she hadn’t spoken, but to her great surprise,\n      they all thought in chorus (I hope you understand what thinking in chorus\n      means—for I must confess that I don’t), ‘Better say nothing\n      at all. Language is worth a thousand pounds a word!’"
  },
  {
    "id": 136,
    "content": "‘I shall dream about a thousand pounds tonight, I know I shall!’ thought\n      Alice."
  },
  {
    "id": 137,
    "content": "All this time the Guard was looking at her, first through a telescope,\n      then through a microscope, and then through an opera-glass. At last he\n      said, ‘You’re travelling the wrong way,’ and shut up the window and went\n      away."
  },
  {
    "id": 138,
    "content": "‘So young a child,’ said the gentleman sitting opposite to her (he was\n      dressed in white paper), ‘ought to know which way she’s going, even if she\n      doesn’t know her own name!’"
  },
  {
    "id": 139,
    "content": "A Goat, that was sitting next to the gentleman in white, shut his eyes and\n      said in a loud voice, ‘She ought to know her way to the ticket-office,\n      even if she doesn’t know her alphabet!’"
  },
  {
    "id": 140,
    "content": "There was a Beetle sitting next to the Goat (it was a very queer\n      carriage-full of passengers altogether), and, as the rule seemed to be\n      that they should all speak in turn, he went on with ‘She’ll have to go\n      back from here as luggage!’"
  },
  {
    "id": 141,
    "content": "Alice couldn’t see who was sitting beyond the Beetle, but a hoarse voice\n      spoke next. ‘Change engines—’ it said, and was obliged to leave off."
  },
  {
    "id": 142,
    "content": "‘It sounds like a horse,’ Alice thought to herself. And an extremely small\n      voice, close to her ear, said, ‘You might make a joke on that—something\n      about “horse” and “hoarse,” you know.’"
  },
  {
    "id": 143,
    "content": "Then a very gentle voice in the distance said, ‘She must be labelled\n      “Lass, with care,” you know—’"
  },
  {
    "id": 144,
    "content": "And after that other voices went on (‘What a number of people there are in\n      the carriage!’ thought Alice), saying, ‘She must go by post, as she’s got\n      a head on her—’ ‘She must be sent as a message by the telegraph—’\n      ‘She must draw the train herself the rest of the way—’ and so on."
  },
  {
    "id": 145,
    "content": "But the gentleman dressed in white paper leaned forwards and whispered in\n      her ear, ‘Never mind what they all say, my dear, but take a return-ticket\n      every time the train stops.’"
  },
  {
    "id": 146,
    "content": "‘Indeed I shan’t!’ Alice said rather impatiently. ‘I don’t belong to this\n      railway journey at all—I was in a wood just now—and I wish I\n      could get back there.’"
  },
  {
    "id": 147,
    "content": "‘You might make a joke on that,’ said the little voice close to her ear:\n      ‘something about “you would if you could,” you know.’"
  },
  {
    "id": 148,
    "content": "‘Don’t tease so,’ said Alice, looking about in vain to see where the voice\n      came from; ‘if you’re so anxious to have a joke made, why don’t you make\n      one yourself?’"
  },
  {
    "id": 149,
    "content": "The little voice sighed deeply: it was very unhappy, evidently, and Alice\n      would have said something pitying to comfort it, ‘If it would only sigh\n      like other people!’ she thought. But this was such a wonderfully small\n      sigh, that she wouldn’t have heard it at all, if it hadn’t come quite\n      close to her ear. The consequence of this was that it tickled her ear very\n      much, and quite took off her thoughts from the unhappiness of the poor\n      little creature."
  },
  {
    "id": 150,
    "content": "‘I know you are a friend,’ the little voice went on; ‘a dear friend, and\n      an old friend. And you won’t hurt me, though I am an insect.’"
  },
  {
    "id": 151,
    "content": "‘What kind of insect?’ Alice inquired a little anxiously. What she really\n      wanted to know was, whether it could sting or not, but she thought this\n      wouldn’t be quite a civil question to ask."
  },
  {
    "id": 152,
    "content": "‘What, then you don’t—’ the little voice began, when it was drowned\n      by a shrill scream from the engine, and everybody jumped up in alarm,\n      Alice among the rest."
  },
  {
    "id": 153,
    "content": "The Horse, who had put his head out of the window, quietly drew it in and\n      said, ‘It’s only a brook we have to jump over.’ Everybody seemed satisfied\n      with this, though Alice felt a little nervous at the idea of trains\n      jumping at all. ‘However, it’ll take us into the Fourth Square, that’s\n      some comfort!’ she said to herself. In another moment she felt the\n      carriage rise straight up into the air, and in her fright she caught at\n      the thing nearest to her hand, which happened to be the Goat’s beard."
  },
  {
    "id": 154,
    "content": "But the beard seemed to melt away as she touched it, and she found herself\n      sitting quietly under a tree—while the Gnat (for that was the insect\n      she had been talking to) was balancing itself on a twig just over her\n      head, and fanning her with its wings."
  },
  {
    "id": 155,
    "content": "It certainly was a very large Gnat: ‘about the size of a chicken,’ Alice\n      thought. Still, she couldn’t feel nervous with it, after they had been\n      talking together so long."
  },
  {
    "id": 156,
    "content": "‘—then you don’t like all insects?’ the Gnat went on, as quietly as\n      if nothing had happened."
  },
  {
    "id": 157,
    "content": "‘I like them when they can talk,’ Alice said. ‘None of them ever talk,\n      where I come from.’"
  },
  {
    "id": 158,
    "content": "‘What sort of insects do you rejoice in, where you come from?’ the Gnat\n      inquired."
  },
  {
    "id": 159,
    "content": "‘I don’t rejoice in insects at all,’ Alice explained, ‘because I’m rather\n      afraid of them—at least the large kinds. But I can tell you the\n      names of some of them.’"
  },
  {
    "id": 160,
    "content": "‘Of course they answer to their names?’ the Gnat remarked carelessly."
  },
  {
    "id": 161,
    "content": "‘I never knew them to do it.’"
  },
  {
    "id": 162,
    "content": "‘What’s the use of their having names,’ the Gnat said, ‘if they won’t\n      answer to them?’"
  },
  {
    "id": 163,
    "content": "‘No use to them,’ said Alice; ‘but it’s useful to the people who name\n      them, I suppose. If not, why do things have names at all?’"
  },
  {
    "id": 164,
    "content": "‘I can’t say,’ the Gnat replied. ‘Further on, in the wood down there,\n      they’ve got no names—however, go on with your list of insects:\n      you’re wasting time.’"
  },
  {
    "id": 165,
    "content": "‘Well, there’s the Horse-fly,’ Alice began, counting off the names on her\n      fingers."
  },
  {
    "id": 166,
    "content": "‘All right,’ said the Gnat: ‘half way up that bush, you’ll see a\n      Rocking-horse-fly, if you look. It’s made entirely of wood, and gets about\n      by swinging itself from branch to branch.’"
  },
  {
    "id": 167,
    "content": "‘What does it live on?’ Alice asked, with great curiosity."
  },
  {
    "id": 168,
    "content": "‘Sap and sawdust,’ said the Gnat. ‘Go on with the list.’"
  },
  {
    "id": 169,
    "content": "Alice looked up at the Rocking-horse-fly with great interest, and made up\n      her mind that it must have been just repainted, it looked so bright and\n      sticky; and then she went on."
  },
  {
    "id": 170,
    "content": "‘And there’s the Dragon-fly.’"
  },
  {
    "id": 171,
    "content": "‘Look on the branch above your head,’ said the Gnat, ‘and there you’ll\n      find a snap-dragon-fly. Its body is made of plum-pudding, its wings of\n      holly-leaves, and its head is a raisin burning in brandy.’"
  },
  {
    "id": 172,
    "content": "‘And what does it live on?’"
  },
  {
    "id": 173,
    "content": "‘Frumenty and mince pie,’ the Gnat replied; ‘and it makes its nest in a\n      Christmas box.’"
  },
  {
    "id": 174,
    "content": "‘And then there’s the Butterfly,’ Alice went on, after she had taken a\n      good look at the insect with its head on fire, and had thought to herself,\n      ‘I wonder if that’s the reason insects are so fond of flying into candles—because\n      they want to turn into Snap-dragon-flies!’"
  },
  {
    "id": 175,
    "content": "‘Crawling at your feet,’ said the Gnat (Alice drew her feet back in some\n      alarm), ‘you may observe a Bread-and-Butterfly. Its wings are thin slices\n      of Bread-and-butter, its body is a crust, and its head is a lump of\n      sugar.’"
  },
  {
    "id": 176,
    "content": "‘And what does it live on?’"
  },
  {
    "id": 177,
    "content": "‘Weak tea with cream in it.’"
  },
  {
    "id": 178,
    "content": "A new difficulty came into Alice’s head. ‘Supposing it couldn’t find any?’\n      she suggested."
  },
  {
    "id": 179,
    "content": "‘Then it would die, of course.’"
  },
  {
    "id": 180,
    "content": "‘But that must happen very often,’ Alice remarked thoughtfully."
  },
  {
    "id": 181,
    "content": "‘It always happens,’ said the Gnat."
  },
  {
    "id": 182,
    "content": "After this, Alice was silent for a minute or two, pondering. The Gnat\n      amused itself meanwhile by humming round and round her head: at last it\n      settled again and remarked, ‘I suppose you don’t want to lose your name?’"
  },
  {
    "id": 183,
    "content": "‘No, indeed,’ Alice said, a little anxiously."
  },
  {
    "id": 184,
    "content": "‘And yet I don’t know,’ the Gnat went on in a careless tone: ‘only think\n      how convenient it would be if you could manage to go home without it! For\n      instance, if the governess wanted to call you to your lessons, she would\n      call out “come here—,” and there she would have to leave off,\n      because there wouldn’t be any name for her to call, and of course you\n      wouldn’t have to go, you know.’"
  },
  {
    "id": 185,
    "content": "‘That would never do, I’m sure,’ said Alice: ‘the governess would never\n      think of excusing me lessons for that. If she couldn’t remember my name,\n      she’d call me “Miss!” as the servants do.’"
  },
  {
    "id": 186,
    "content": "‘Well, if she said “Miss,” and didn’t say anything more,’ the Gnat\n      remarked, ‘of course you’d miss your lessons. That’s a joke. I wish you\n      had made it.’"
  },
  {
    "id": 187,
    "content": "‘Why do you wish I had made it?’ Alice asked. ‘It’s a very bad\n      one.’"
  },
  {
    "id": 188,
    "content": "But the Gnat only sighed deeply, while two large tears came rolling down\n      its cheeks."
  },
  {
    "id": 189,
    "content": "‘You shouldn’t make jokes,’ Alice said, ‘if it makes you so unhappy.’"
  },
  {
    "id": 190,
    "content": "Then came another of those melancholy little sighs, and this time the poor\n      Gnat really seemed to have sighed itself away, for, when Alice looked up,\n      there was nothing whatever to be seen on the twig, and, as she was getting\n      quite chilly with sitting still so long, she got up and walked on."
  },
  {
    "id": 191,
    "content": "She very soon came to an open field, with a wood on the other side of it:\n      it looked much darker than the last wood, and Alice felt a little timid\n      about going into it. However, on second thoughts, she made up her mind to\n      go on: ‘for I certainly won’t go back,’ she thought to herself, and this\n      was the only way to the Eighth Square."
  },
  {
    "id": 192,
    "content": "‘This must be the wood,’ she said thoughtfully to herself, ‘where things\n      have no names. I wonder what’ll become of my name when I go in? I\n      shouldn’t like to lose it at all—because they’d have to give me\n      another, and it would be almost certain to be an ugly one. But then the\n      fun would be trying to find the creature that had got my old name! That’s\n      just like the advertisements, you know, when people lose dogs—“answers\n      to the name of ‘Dash:’ had on a brass collar”—just fancy calling\n      everything you met “Alice,” till one of them answered! Only they wouldn’t\n      answer at all, if they were wise.’"
  },
  {
    "id": 193,
    "content": "She was rambling on in this way when she reached the wood: it looked very\n      cool and shady. ‘Well, at any rate it’s a great comfort,’ she said as she\n      stepped under the trees, ‘after being so hot, to get into the—into\n      what?’ she went on, rather surprised at not being able to think of the\n      word. ‘I mean to get under the—under the—under this, you\n      know!’ putting her hand on the trunk of the tree. ‘What does it call\n      itself, I wonder? I do believe it’s got no name—why, to be sure it\n      hasn’t!’"
  },
  {
    "id": 194,
    "content": "She stood silent for a minute, thinking: then she suddenly began again.\n      ‘Then it really has happened, after all! And now, who am I? I will\n      remember, if I can! I’m determined to do it!’ But being determined didn’t\n      help much, and all she could say, after a great deal of puzzling, was, ‘L,\n      I know it begins with L!’"
  },
  {
    "id": 195,
    "content": "Just then a Fawn came wandering by: it looked at Alice with its large\n      gentle eyes, but didn’t seem at all frightened. ‘Here then! Here then!’\n      Alice said, as she held out her hand and tried to stroke it; but it only\n      started back a little, and then stood looking at her again."
  },
  {
    "id": 196,
    "content": "‘What do you call yourself?’ the Fawn said at last. Such a soft sweet\n      voice it had!"
  },
  {
    "id": 197,
    "content": "‘I wish I knew!’ thought poor Alice. She answered, rather sadly, ‘Nothing,\n      just now.’"
  },
  {
    "id": 198,
    "content": "‘Think again,’ it said: ‘that won’t do.’"
  },
  {
    "id": 199,
    "content": "Alice thought, but nothing came of it. ‘Please, would you tell me what you\n      call yourself?’ she said timidly. ‘I think that might help a little.’"
  },
  {
    "id": 200,
    "content": "‘I’ll tell you, if you’ll move a little further on,’ the Fawn said. ‘I\n      can’t remember here.’"
  },
  {
    "id": 201,
    "content": "So they walked on together though the wood, Alice with her arms clasped\n      lovingly round the soft neck of the Fawn, till they came out into another\n      open field, and here the Fawn gave a sudden bound into the air, and shook\n      itself free from Alice’s arms. ‘I’m a Fawn!’ it cried out in a voice of\n      delight, ‘and, dear me! you’re a human child!’ A sudden look of alarm came\n      into its beautiful brown eyes, and in another moment it had darted away at\n      full speed."
  },
  {
    "id": 202,
    "content": "Alice stood looking after it, almost ready to cry with vexation at having\n      lost her dear little fellow-traveller so suddenly. ‘However, I know my\n      name now.’ she said, ‘that’s some comfort. Alice—Alice—I won’t\n      forget it again. And now, which of these finger-posts ought I to follow, I\n      wonder?’"
  },
  {
    "id": 203,
    "content": "It was not a very difficult question to answer, as there was only one road\n      through the wood, and the two finger-posts both pointed along it. ‘I’ll\n      settle it,’ Alice said to herself, ‘when the road divides and they point\n      different ways.’"
  },
  {
    "id": 204,
    "content": "But this did not seem likely to happen. She went on and on, a long way,\n      but wherever the road divided there were sure to be two finger-posts\n      pointing the same way, one marked ‘TO TWEEDLEDUM’S HOUSE’ and the other\n      ‘TO THE HOUSE OF TWEEDLEDEE.’"
  },
  {
    "id": 205,
    "content": "‘I do believe,’ said Alice at last, ‘that they live in the same house! I\n      wonder I never thought of that before—But I can’t stay there long.\n      I’ll just call and say “how d’you do?” and ask them the way out of the\n      wood. If I could only get to the Eighth Square before it gets dark!’ So\n      she wandered on, talking to herself as she went, till, on turning a sharp\n      corner, she came upon two fat little men, so suddenly that she could not\n      help starting back, but in another moment she recovered herself, feeling\n      sure that they must be."
  },
  {
    "id": 206,
    "content": "They were standing under a tree, each with an arm round the other’s neck,\n      and Alice knew which was which in a moment, because one of them had ‘DUM’\n      embroidered on his collar, and the other ‘DEE.’ ‘I suppose they’ve each\n      got “TWEEDLE” round at the back of the collar,’ she said to herself."
  },
  {
    "id": 207,
    "content": "They stood so still that she quite forgot they were alive, and she was\n      just looking round to see if the word “TWEEDLE” was written at the back of\n      each collar, when she was startled by a voice coming from the one marked\n      ‘DUM.’"
  },
  {
    "id": 208,
    "content": "‘If you think we’re wax-works,’ he said, ‘you ought to pay, you know.\n      Wax-works weren’t made to be looked at for nothing, nohow!’"
  },
  {
    "id": 209,
    "content": "‘Contrariwise,’ added the one marked ‘DEE,’ ‘if you think we’re alive, you\n      ought to speak.’"
  },
  {
    "id": 210,
    "content": "‘I’m sure I’m very sorry,’ was all Alice could say; for the words of the\n      old song kept ringing through her head like the ticking of a clock, and\n      she could hardly help saying them out loud:—"
  },
  {
    "id": 211,
    "content": "‘I know what you’re thinking about,’ said Tweedledum: ‘but it isn’t so,\n      nohow.’"
  },
  {
    "id": 212,
    "content": "‘Contrariwise,’ continued Tweedledee, ‘if it was so, it might be; and if\n      it were so, it would be; but as it isn’t, it ain’t. That’s logic.’"
  },
  {
    "id": 213,
    "content": "‘I was thinking,’ Alice said very politely, ‘which is the best way out of\n      this wood: it’s getting so dark. Would you tell me, please?’"
  },
  {
    "id": 214,
    "content": "But the little men only looked at each other and grinned."
  },
  {
    "id": 215,
    "content": "They looked so exactly like a couple of great schoolboys, that Alice\n      couldn’t help pointing her finger at Tweedledum, and saying ‘First Boy!’"
  },
  {
    "id": 216,
    "content": "‘Nohow!’ Tweedledum cried out briskly, and shut his mouth up again with a\n      snap."
  },
  {
    "id": 217,
    "content": "‘Next Boy!’ said Alice, passing on to Tweedledee, though she felt quite\n      certain he would only shout out ‘Contrariwise!’ and so he did."
  },
  {
    "id": 218,
    "content": "‘You’ve been wrong!’ cried Tweedledum. ‘The first thing in a visit is to\n      say “How d’ye do?” and shake hands!’ And here the two brothers gave each\n      other a hug, and then they held out the two hands that were free, to shake\n      hands with her."
  },
  {
    "id": 219,
    "content": "Alice did not like shaking hands with either of them first, for fear of\n      hurting the other one’s feelings; so, as the best way out of the\n      difficulty, she took hold of both hands at once: the next moment they were\n      dancing round in a ring. This seemed quite natural (she remembered\n      afterwards), and she was not even surprised to hear music playing: it\n      seemed to come from the tree under which they were dancing, and it was\n      done (as well as she could make it out) by the branches rubbing one across\n      the other, like fiddles and fiddle-sticks."
  },
  {
    "id": 220,
    "content": "‘But it certainly was funny,’ (Alice said afterwards, when she was telling\n      her sister the history of all this,) ‘to find myself singing “Here we go\n      round the mulberry bush.” I don’t know when I began it, but somehow I felt\n      as if I’d been singing it a long long time!’"
  },
  {
    "id": 221,
    "content": "The other two dancers were fat, and very soon out of breath. ‘Four times\n      round is enough for one dance,’ Tweedledum panted out, and they left off\n      dancing as suddenly as they had begun: the music stopped at the same\n      moment."
  },
  {
    "id": 222,
    "content": "Then they let go of Alice’s hands, and stood looking at her for a minute:\n      there was a rather awkward pause, as Alice didn’t know how to begin a\n      conversation with people she had just been dancing with. ‘It would never\n      do to say “How d’ye do?” now,’ she said to herself: ‘we seem to have got\n      beyond that, somehow!’"
  },
  {
    "id": 223,
    "content": "‘I hope you’re not much tired?’ she said at last."
  },
  {
    "id": 224,
    "content": "‘Nohow. And thank you very much for asking,’ said Tweedledum."
  },
  {
    "id": 225,
    "content": "‘So much obliged!’ added Tweedledee. ‘You like poetry?’"
  },
  {
    "id": 226,
    "content": "‘Ye-es, pretty well—some poetry,’ Alice said doubtfully. ‘Would you\n      tell me which road leads out of the wood?’"
  },
  {
    "id": 227,
    "content": "‘What shall I repeat to her?’ said Tweedledee, looking round at Tweedledum\n      with great solemn eyes, and not noticing Alice’s question."
  },
  {
    "id": 228,
    "content": "‘“The Walrus and the Carpenter” is the longest,’ Tweedledum replied,\n      giving his brother an affectionate hug."
  },
  {
    "id": 229,
    "content": "Tweedledee began instantly:"
  },
  {
    "id": 230,
    "content": "Here Alice ventured to interrupt him. ‘If it’s very long,’ she said, as\n      politely as she could, ‘would you please tell me first which road—’"
  },
  {
    "id": 231,
    "content": "Tweedledee smiled gently, and began again:"
  },
  {
    "id": 232,
    "content": "‘I like the Walrus best,’ said Alice: ‘because you see he was a little\n      sorry for the poor oysters.’"
  },
  {
    "id": 233,
    "content": "‘He ate more than the Carpenter, though,’ said Tweedledee. ‘You see he\n      held his handkerchief in front, so that the Carpenter couldn’t count how\n      many he took: contrariwise.’"
  },
  {
    "id": 234,
    "content": "‘That was mean!’ Alice said indignantly. ‘Then I like the Carpenter best—if\n      he didn’t eat so many as the Walrus.’"
  },
  {
    "id": 235,
    "content": "‘But he ate as many as he could get,’ said Tweedledum."
  },
  {
    "id": 236,
    "content": "This was a puzzler. After a pause, Alice began, ‘Well! They were both very\n      unpleasant characters—’ Here she checked herself in some alarm, at\n      hearing something that sounded to her like the puffing of a large\n      steam-engine in the wood near them, though she feared it was more likely\n      to be a wild beast. ‘Are there any lions or tigers about here?’ she asked\n      timidly."
  },
  {
    "id": 237,
    "content": "‘It’s only the Red King snoring,’ said Tweedledee."
  },
  {
    "id": 238,
    "content": "‘Come and look at him!’ the brothers cried, and they each took one of\n      Alice’s hands, and led her up to where the King was sleeping."
  },
  {
    "id": 239,
    "content": "‘Isn’t he a lovely sight?’ said Tweedledum."
  },
  {
    "id": 240,
    "content": "Alice couldn’t say honestly that he was. He had a tall red night-cap on,\n      with a tassel, and he was lying crumpled up into a sort of untidy heap,\n      and snoring loud—‘fit to snore his head off!’ as Tweedledum\n      remarked."
  },
  {
    "id": 241,
    "content": "‘I’m afraid he’ll catch cold with lying on the damp grass,’ said Alice,\n      who was a very thoughtful little girl."
  },
  {
    "id": 242,
    "content": "‘He’s dreaming now,’ said Tweedledee: ‘and what do you think he’s dreaming\n      about?’"
  },
  {
    "id": 243,
    "content": "Alice said ‘Nobody can guess that.’"
  },
  {
    "id": 244,
    "content": "‘Why, about you!’ Tweedledee exclaimed, clapping his hands triumphantly.\n      ‘And if he left off dreaming about you, where do you suppose you’d be?’"
  },
  {
    "id": 245,
    "content": "‘Where I am now, of course,’ said Alice."
  },
  {
    "id": 246,
    "content": "‘Not you!’ Tweedledee retorted contemptuously. ‘You’d be nowhere. Why,\n      you’re only a sort of thing in his dream!’"
  },
  {
    "id": 247,
    "content": "‘If that there King was to wake,’ added Tweedledum, ‘you’d go out—bang!—just\n      like a candle!’"
  },
  {
    "id": 248,
    "content": "‘I shouldn’t!’ Alice exclaimed indignantly. ‘Besides, if I’m only a sort\n      of thing in his dream, what are you, I should like to know?’"
  },
  {
    "id": 249,
    "content": "‘Ditto’ said Tweedledum."
  },
  {
    "id": 250,
    "content": "‘Ditto, ditto’ cried Tweedledee."
  },
  {
    "id": 251,
    "content": "He shouted this so loud that Alice couldn’t help saying, ‘Hush! You’ll be\n      waking him, I’m afraid, if you make so much noise.’"
  },
  {
    "id": 252,
    "content": "‘Well, it no use your talking about waking him,’ said Tweedledum, ‘when\n      you’re only one of the things in his dream. You know very well you’re not\n      real.’"
  },
  {
    "id": 253,
    "content": "‘I am real!’ said Alice and began to cry."
  },
  {
    "id": 254,
    "content": "‘You won’t make yourself a bit realler by crying,’ Tweedledee remarked:\n      ‘there’s nothing to cry about.’"
  },
  {
    "id": 255,
    "content": "‘If I wasn’t real,’ Alice said—half-laughing through her tears, it\n      all seemed so ridiculous—‘I shouldn’t be able to cry.’"
  },
  {
    "id": 256,
    "content": "‘I hope you don’t suppose those are real tears?’ Tweedledum interrupted in\n      a tone of great contempt."
  },
  {
    "id": 257,
    "content": "‘I know they’re talking nonsense,’ Alice thought to herself: ‘and it’s\n      foolish to cry about it.’ So she brushed away her tears, and went on as\n      cheerfully as she could. ‘At any rate I’d better be getting out of the\n      wood, for really it’s coming on very dark. Do you think it’s going to\n      rain?’"
  },
  {
    "id": 258,
    "content": "Tweedledum spread a large umbrella over himself and his brother, and\n      looked up into it. ‘No, I don’t think it is,’ he said: ‘at least—not\n      under here. Nohow.’"
  },
  {
    "id": 259,
    "content": "‘But it may rain outside?’"
  },
  {
    "id": 260,
    "content": "‘It may—if it chooses,’ said Tweedledee: ‘we’ve no objection.\n      Contrariwise.’"
  },
  {
    "id": 261,
    "content": "‘Selfish things!’ thought Alice, and she was just going to say\n      ‘Good-night’ and leave them, when Tweedledum sprang out from under the\n      umbrella and seized her by the wrist."
  },
  {
    "id": 262,
    "content": "‘Do you see that?’ he said, in a voice choking with passion, and his eyes\n      grew large and yellow all in a moment, as he pointed with a trembling\n      finger at a small white thing lying under the tree."
  },
  {
    "id": 263,
    "content": "‘It’s only a rattle,’ Alice said, after a careful examination of the\n      little white thing. ‘Not a rattle-snake, you know,’ she added hastily,\n      thinking that he was frightened: ‘only an old rattle—quite old and\n      broken.’"
  },
  {
    "id": 264,
    "content": "‘I knew it was!’ cried Tweedledum, beginning to stamp about wildly and\n      tear his hair. ‘It’s spoilt, of course!’ Here he looked at Tweedledee, who\n      immediately sat down on the ground, and tried to hide himself under the\n      umbrella."
  },
  {
    "id": 265,
    "content": "Alice laid her hand upon his arm, and said in a soothing tone, ‘You\n      needn’t be so angry about an old rattle.’"
  },
  {
    "id": 266,
    "content": "‘But it isn’t old!’ Tweedledum cried, in a greater fury than ever. ‘It’s\n      new, I tell you—I bought it yesterday—my nice new RATTLE!’ and\n      his voice rose to a perfect scream."
  },
  {
    "id": 267,
    "content": "All this time Tweedledee was trying his best to fold up the umbrella, with\n      himself in it: which was such an extraordinary thing to do, that it quite\n      took off Alice’s attention from the angry brother. But he couldn’t quite\n      succeed, and it ended in his rolling over, bundled up in the umbrella,\n      with only his head out: and there he lay, opening and shutting his mouth\n      and his large eyes—‘looking more like a fish than anything else,’\n      Alice thought."
  },
  {
    "id": 268,
    "content": "‘Of course you agree to have a battle?’ Tweedledum said in a calmer tone."
  },
  {
    "id": 269,
    "content": "‘I suppose so,’ the other sulkily replied, as he crawled out of the\n      umbrella: ‘only she must help us to dress up, you know.’"
  },
  {
    "id": 270,
    "content": "So the two brothers went off hand-in-hand into the wood, and returned in a\n      minute with their arms full of things—such as bolsters, blankets,\n      hearth-rugs, table-cloths, dish-covers and coal-scuttles. ‘I hope you’re a\n      good hand at pinning and tying strings?’ Tweedledum remarked. ‘Every one\n      of these things has got to go on, somehow or other.’"
  },
  {
    "id": 271,
    "content": "Alice said afterwards she had never seen such a fuss made about anything\n      in all her life—the way those two bustled about—and the\n      quantity of things they put on—and the trouble they gave her in\n      tying strings and fastening buttons—‘Really they’ll be more like\n      bundles of old clothes than anything else, by the time they’re ready!’ she\n      said to herself, as she arranged a bolster round the neck of Tweedledee,\n      ‘to keep his head from being cut off,’ as he said."
  },
  {
    "id": 272,
    "content": "‘You know,’ he added very gravely, ‘it’s one of the most serious things\n      that can possibly happen to one in a battle—to get one’s head cut\n      off.’"
  },
  {
    "id": 273,
    "content": "Alice laughed aloud: but she managed to turn it into a cough, for fear of\n      hurting his feelings."
  },
  {
    "id": 274,
    "content": "‘Do I look very pale?’ said Tweedledum, coming up to have his helmet tied\n      on. (He called it a helmet, though it certainly looked much more like a\n      saucepan.)"
  },
  {
    "id": 275,
    "content": "‘Well—yes—a little,’ Alice replied gently."
  },
  {
    "id": 276,
    "content": "‘I’m very brave generally,’ he went on in a low voice: ‘only to-day I\n      happen to have a headache.’"
  },
  {
    "id": 277,
    "content": "‘And I’ve got a toothache!’ said Tweedledee, who had overheard the remark.\n      ‘I’m far worse off than you!’"
  },
  {
    "id": 278,
    "content": "‘Then you’d better not fight to-day,’ said Alice, thinking it a good\n      opportunity to make peace."
  },
  {
    "id": 279,
    "content": "‘We must have a bit of a fight, but I don’t care about going on long,’\n      said Tweedledum. ‘What’s the time now?’"
  },
  {
    "id": 280,
    "content": "Tweedledee looked at his watch, and said ‘Half-past four.’"
  },
  {
    "id": 281,
    "content": "‘Let’s fight till six, and then have dinner,’ said Tweedledum."
  },
  {
    "id": 282,
    "content": "‘Very well,’ the other said, rather sadly: ‘and she can watch us—only\n      you’d better not come very close,’ he added: ‘I generally hit everything I\n      can see—when I get really excited.’"
  },
  {
    "id": 283,
    "content": "‘And I hit everything within reach,’ cried Tweedledum, ‘whether I\n      can see it or not!’"
  },
  {
    "id": 284,
    "content": "Alice laughed. ‘You must hit the trees pretty often, I should think,’ she\n      said."
  },
  {
    "id": 285,
    "content": "Tweedledum looked round him with a satisfied smile. ‘I don’t suppose,’ he\n      said, ‘there’ll be a tree left standing, for ever so far round, by the\n      time we’ve finished!’"
  },
  {
    "id": 286,
    "content": "‘And all about a rattle!’ said Alice, still hoping to make them a little\n      ashamed of fighting for such a trifle."
  },
  {
    "id": 287,
    "content": "‘I shouldn’t have minded it so much,’ said Tweedledum, ‘if it hadn’t been\n      a new one.’"
  },
  {
    "id": 288,
    "content": "‘I wish the monstrous crow would come!’ thought Alice."
  },
  {
    "id": 289,
    "content": "‘There’s only one sword, you know,’ Tweedledum said to his brother: ‘but\n      you can have the umbrella—it’s quite as sharp. Only we must begin\n      quick. It’s getting as dark as it can.’"
  },
  {
    "id": 290,
    "content": "‘And darker,’ said Tweedledee."
  },
  {
    "id": 291,
    "content": "It was getting dark so suddenly that Alice thought there must be a\n      thunderstorm coming on. ‘What a thick black cloud that is!’ she said. ‘And\n      how fast it comes! Why, I do believe it’s got wings!’"
  },
  {
    "id": 292,
    "content": "‘It’s the crow!’ Tweedledum cried out in a shrill voice of alarm: and the\n      two brothers took to their heels and were out of sight in a moment."
  },
  {
    "id": 293,
    "content": "Alice ran a little way into the wood, and stopped under a large tree. ‘It\n      can never get at me here,’ she thought: ‘it’s far too large to squeeze\n      itself in among the trees. But I wish it wouldn’t flap its wings so—it\n      makes quite a hurricane in the wood—here’s somebody’s shawl being\n      blown away!’"
  },
  {
    "id": 294,
    "content": "She caught the shawl as she spoke, and looked about for the owner: in\n      another moment the White Queen came running wildly through the wood, with\n      both arms stretched out wide, as if she were flying, and Alice very\n      civilly went to meet her with the shawl."
  },
  {
    "id": 295,
    "content": "‘I’m very glad I happened to be in the way,’ Alice said, as she helped her\n      to put on her shawl again."
  },
  {
    "id": 296,
    "content": "The White Queen only looked at her in a helpless frightened sort of way,\n      and kept repeating something in a whisper to herself that sounded like\n      ‘bread-and-butter, bread-and-butter,’ and Alice felt that if there was to\n      be any conversation at all, she must manage it herself. So she began\n      rather timidly: ‘Am I addressing the White Queen?’"
  },
  {
    "id": 297,
    "content": "‘Well, yes, if you call that a-dressing,’ The Queen said. ‘It isn’t my\n      notion of the thing, at all.’"
  },
  {
    "id": 298,
    "content": "Alice thought it would never do to have an argument at the very beginning\n      of their conversation, so she smiled and said, ‘If your Majesty will only\n      tell me the right way to begin, I’ll do it as well as I can.’"
  },
  {
    "id": 299,
    "content": "‘But I don’t want it done at all!’ groaned the poor Queen. ‘I’ve been\n      a-dressing myself for the last two hours.’"
  },
  {
    "id": 300,
    "content": "It would have been all the better, as it seemed to Alice, if she had got\n      some one else to dress her, she was so dreadfully untidy. ‘Every single\n      thing’s crooked,’ Alice thought to herself, ‘and she’s all over pins!—may\n      I put your shawl straight for you?’ she added aloud."
  },
  {
    "id": 301,
    "content": "‘I don’t know what’s the matter with it!’ the Queen said, in a melancholy\n      voice. ‘It’s out of temper, I think. I’ve pinned it here, and I’ve pinned\n      it there, but there’s no pleasing it!’"
  },
  {
    "id": 302,
    "content": "‘It can’t go straight, you know, if you pin it all on one side,’ Alice\n      said, as she gently put it right for her; ‘and, dear me, what a state your\n      hair is in!’"
  },
  {
    "id": 303,
    "content": "‘The brush has got entangled in it!’ the Queen said with a sigh. ‘And I\n      lost the comb yesterday.’"
  },
  {
    "id": 304,
    "content": "Alice carefully released the brush, and did her best to get the hair into\n      order. ‘Come, you look rather better now!’ she said, after altering most\n      of the pins. ‘But really you should have a lady’s maid!’"
  },
  {
    "id": 305,
    "content": "‘I’m sure I’ll take you with pleasure!’ the Queen said. ‘Twopence a week,\n      and jam every other day.’"
  },
  {
    "id": 306,
    "content": "Alice couldn’t help laughing, as she said, ‘I don’t want you to hire me—and\n      I don’t care for jam.’"
  },
  {
    "id": 307,
    "content": "‘It’s very good jam,’ said the Queen."
  },
  {
    "id": 308,
    "content": "‘Well, I don’t want any to-day, at any rate.’"
  },
  {
    "id": 309,
    "content": "‘You couldn’t have it if you did want it,’ the Queen said. ‘The rule is,\n      jam to-morrow and jam yesterday—but never jam to-day.’"
  },
  {
    "id": 310,
    "content": "‘It must come sometimes to “jam to-day,”’ Alice objected."
  },
  {
    "id": 311,
    "content": "‘No, it can’t,’ said the Queen. ‘It’s jam every other day: to-day isn’t\n      any other day, you know.’"
  },
  {
    "id": 312,
    "content": "‘I don’t understand you,’ said Alice. ‘It’s dreadfully confusing!’"
  },
  {
    "id": 313,
    "content": "‘That’s the effect of living backwards,’ the Queen said kindly: ‘it always\n      makes one a little giddy at first—’"
  },
  {
    "id": 314,
    "content": "‘Living backwards!’ Alice repeated in great astonishment. ‘I never heard\n      of such a thing!’"
  },
  {
    "id": 315,
    "content": "‘—but there’s one great advantage in it, that one’s memory works\n      both ways.’"
  },
  {
    "id": 316,
    "content": "‘I’m sure mine only works one way,’ Alice remarked. ‘I can’t remember\n      things before they happen.’"
  },
  {
    "id": 317,
    "content": "‘It’s a poor sort of memory that only works backwards,’ the Queen\n      remarked."
  },
  {
    "id": 318,
    "content": "‘What sort of things do you remember best?’ Alice ventured to ask."
  },
  {
    "id": 319,
    "content": "‘Oh, things that happened the week after next,’ the Queen replied in a\n      careless tone. ‘For instance, now,’ she went on, sticking a large piece of\n      plaster on her finger as she spoke, ‘there’s the King’s\n      Messenger. He’s in prison now, being punished: and the trial doesn’t even\n      begin till next Wednesday: and of course the crime comes last of all.’"
  },
  {
    "id": 320,
    "content": "‘Suppose he never commits the crime?’ said Alice."
  },
  {
    "id": 321,
    "content": "‘That would be all the better, wouldn’t it?’ the Queen said, as she bound\n      the plaster round her finger with a bit of ribbon."
  },
  {
    "id": 322,
    "content": "Alice felt there was no denying that. ‘Of course it would be all the\n      better,’ she said: ‘but it wouldn’t be all the better his being punished.’"
  },
  {
    "id": 323,
    "content": "‘You’re wrong there, at any rate,’ said the Queen: ‘were you ever\n      punished?’"
  },
  {
    "id": 324,
    "content": "‘Only for faults,’ said Alice."
  },
  {
    "id": 325,
    "content": "‘And you were all the better for it, I know!’ the Queen said triumphantly."
  },
  {
    "id": 326,
    "content": "‘Yes, but then I had done the things I was punished for,’ said Alice:\n      ‘that makes all the difference.’"
  },
  {
    "id": 327,
    "content": "‘But if you hadn’t done them,’ the Queen said, ‘that would have been\n      better still; better, and better, and better!’ Her voice went higher with\n      each ‘better,’ till it got quite to a squeak at last."
  },
  {
    "id": 328,
    "content": "Alice was just beginning to say ‘There’s a mistake somewhere—,’ when\n      the Queen began screaming so loud that she had to leave the sentence\n      unfinished. ‘Oh, oh, oh!’ shouted the Queen, shaking her hand about as if\n      she wanted to shake it off. ‘My finger’s bleeding! Oh, oh, oh, oh!’"
  },
  {
    "id": 329,
    "content": "Her screams were so exactly like the whistle of a steam-engine, that Alice\n      had to hold both her hands over her ears."
  },
  {
    "id": 330,
    "content": "‘What is the matter?’ she said, as soon as there was a chance of making\n      herself heard. ‘Have you pricked your finger?’"
  },
  {
    "id": 331,
    "content": "‘I haven’t pricked it yet,’ the Queen said, ‘but I soon shall—oh,\n      oh, oh!’"
  },
  {
    "id": 332,
    "content": "‘When do you expect to do it?’ Alice asked, feeling very much inclined to\n      laugh."
  },
  {
    "id": 333,
    "content": "‘When I fasten my shawl again,’ the poor Queen groaned out: ‘the brooch\n      will come undone directly. Oh, oh!’ As she said the words the brooch flew\n      open, and the Queen clutched wildly at it, and tried to clasp it again."
  },
  {
    "id": 334,
    "content": "‘Take care!’ cried Alice. ‘You’re holding it all crooked!’ And she caught\n      at the brooch; but it was too late: the pin had slipped, and the Queen had\n      pricked her finger."
  },
  {
    "id": 335,
    "content": "‘That accounts for the bleeding, you see,’ she said to Alice with a smile.\n      ‘Now you understand the way things happen here.’"
  },
  {
    "id": 336,
    "content": "‘But why don’t you scream now?’ Alice asked, holding her hands ready to\n      put over her ears again."
  },
  {
    "id": 337,
    "content": "‘Why, I’ve done all the screaming already,’ said the Queen. ‘What would be\n      the good of having it all over again?’"
  },
  {
    "id": 338,
    "content": "By this time it was getting light. ‘The crow must have flown away, I\n      think,’ said Alice: ‘I’m so glad it’s gone. I thought it was the night\n      coming on.’"
  },
  {
    "id": 339,
    "content": "‘I wish I could manage to be glad!’ the Queen said. ‘Only I never\n      can remember the rule. You must be very happy, living in this wood, and\n      being glad whenever you like!’"
  },
  {
    "id": 340,
    "content": "‘Only it is so very lonely here!’ Alice said in a melancholy voice; and at\n      the thought of her loneliness two large tears came rolling down her\n      cheeks."
  },
  {
    "id": 341,
    "content": "‘Oh, don’t go on like that!’ cried the poor Queen, wringing her hands in\n      despair. ‘Consider what a great girl you are. Consider what a long way\n      you’ve come to-day. Consider what o’clock it is. Consider anything, only\n      don’t cry!’"
  },
  {
    "id": 342,
    "content": "Alice could not help laughing at this, even in the midst of her tears.\n      ‘Can you keep from crying by considering things?’ she asked."
  },
  {
    "id": 343,
    "content": "‘That’s the way it’s done,’ the Queen said with great decision: ‘nobody\n      can do two things at once, you know. Let’s consider your age to begin with—how\n      old are you?’"
  },
  {
    "id": 344,
    "content": "‘I’m seven and a half exactly.’"
  },
  {
    "id": 345,
    "content": "‘You needn’t say “exactually,”’ the Queen remarked: ‘I can believe it\n      without that. Now I’ll give you something to believe. I’m just one hundred\n      and one, five months and a day.’"
  },
  {
    "id": 346,
    "content": "‘I can’t believe that!’ said Alice."
  },
  {
    "id": 347,
    "content": "‘Can’t you?’ the Queen said in a pitying tone. ‘Try again: draw a long\n      breath, and shut your eyes.’"
  },
  {
    "id": 348,
    "content": "Alice laughed. ‘There’s no use trying,’ she said: ‘one can’t believe\n      impossible things.’"
  },
  {
    "id": 349,
    "content": "‘I daresay you haven’t had much practice,’ said the Queen. ‘When I was\n      your age, I always did it for half-an-hour a day. Why, sometimes I’ve\n      believed as many as six impossible things before breakfast. There goes the\n      shawl again!’"
  },
  {
    "id": 350,
    "content": "The brooch had come undone as she spoke, and a sudden gust of wind blew\n      the Queen’s shawl across a little brook. The Queen spread out her arms\n      again, and went flying after it, and this time she succeeded in catching\n      it for herself. ‘I’ve got it!’ she cried in a triumphant tone. ‘Now you\n      shall see me pin it on again, all by myself!’"
  },
  {
    "id": 351,
    "content": "‘Then I hope your finger is better now?’ Alice said very politely, as she\n      crossed the little brook after the Queen."
  },
  {
    "id": 352,
    "content": "‘Oh, much better!’ cried the Queen, her voice rising to a squeak as she\n      went on. ‘Much be-etter! Be-etter! Be-e-e-etter! Be-e-ehh!’ The last word\n      ended in a long bleat, so like a sheep that Alice quite started."
  },
  {
    "id": 353,
    "content": "She looked at the Queen, who seemed to have suddenly wrapped herself up in\n      wool. Alice rubbed her eyes, and looked again. She couldn’t make out what\n      had happened at all. Was she in a shop? And was that really—was it\n      really a sheep that was sitting on the other side of the counter? Rub as\n      she could, she could make nothing more of it: she was in a little dark\n      shop, leaning with her elbows on the counter, and opposite to her was an\n      old Sheep, sitting in an arm-chair knitting, and every now and then\n      leaving off to look at her through a great pair of spectacles."
  },
  {
    "id": 354,
    "content": "‘What is it you want to buy?’ the Sheep said at last, looking up for a\n      moment from her knitting."
  },
  {
    "id": 355,
    "content": "‘I don’t quite know yet,’ Alice said, very gently. ‘I should like to look\n      all round me first, if I might.’"
  },
  {
    "id": 356,
    "content": "‘You may look in front of you, and on both sides, if you like,’ said the\n      Sheep: ‘but you can’t look all round you—unless you’ve got eyes at\n      the back of your head.’"
  },
  {
    "id": 357,
    "content": "But these, as it happened, Alice had not got: so she contented herself\n      with turning round, looking at the shelves as she came to them."
  },
  {
    "id": 358,
    "content": "The shop seemed to be full of all manner of curious things—but the\n      oddest part of it all was, that whenever she looked hard at any shelf, to\n      make out exactly what it had on it, that particular shelf was always quite\n      empty: though the others round it were crowded as full as they could hold."
  },
  {
    "id": 359,
    "content": "‘Things flow about so here!’ she said at last in a plaintive tone, after\n      she had spent a minute or so in vainly pursuing a large bright thing, that\n      looked sometimes like a doll and sometimes like a work-box, and was always\n      in the shelf next above the one she was looking at. ‘And this one is the\n      most provoking of all—but I’ll tell you what—’ she added, as a\n      sudden thought struck her, ‘I’ll follow it up to the very top shelf of\n      all. It’ll puzzle it to go through the ceiling, I expect!’"
  },
  {
    "id": 360,
    "content": "But even this plan failed: the ‘thing’ went through the ceiling as quietly\n      as possible, as if it were quite used to it."
  },
  {
    "id": 361,
    "content": "‘Are you a child or a teetotum?’ the Sheep said, as she took up another\n      pair of needles. ‘You’ll make me giddy soon, if you go on turning round\n      like that.’ She was now working with fourteen pairs at once, and Alice\n      couldn’t help looking at her in great astonishment."
  },
  {
    "id": 362,
    "content": "‘How can she knit with so many?’ the puzzled child thought to herself.\n      ‘She gets more and more like a porcupine every minute!’"
  },
  {
    "id": 363,
    "content": "‘Can you row?’ the Sheep asked, handing her a pair of knitting-needles as\n      she spoke."
  },
  {
    "id": 364,
    "content": "‘Yes, a little—but not on land—and not with needles—’\n      Alice was beginning to say, when suddenly the needles turned into oars in\n      her hands, and she found they were in a little boat, gliding along between\n      banks: so there was nothing for it but to do her best."
  },
  {
    "id": 365,
    "content": "‘Feather!’ cried the Sheep, as she took up another pair of needles."
  },
  {
    "id": 366,
    "content": "This didn’t sound like a remark that needed any answer, so Alice said\n      nothing, but pulled away. There was something very queer about the water,\n      she thought, as every now and then the oars got fast in it, and would\n      hardly come out again."
  },
  {
    "id": 367,
    "content": "‘Feather! Feather!’ the Sheep cried again, taking more needles. ‘You’ll be\n      catching a crab directly.’"
  },
  {
    "id": 368,
    "content": "‘A dear little crab!’ thought Alice. ‘I should like that.’"
  },
  {
    "id": 369,
    "content": "‘Didn’t you hear me say “Feather”?’ the Sheep cried angrily, taking up\n      quite a bunch of needles."
  },
  {
    "id": 370,
    "content": "‘Indeed I did,’ said Alice: ‘you’ve said it very often—and very\n      loud. Please, where are the crabs?’"
  },
  {
    "id": 371,
    "content": "‘In the water, of course!’ said the Sheep, sticking some of the needles\n      into her hair, as her hands were full. ‘Feather, I say!’"
  },
  {
    "id": 372,
    "content": "‘Why do you say “feather” so often?’ Alice asked at last, rather vexed.\n      ‘I’m not a bird!’"
  },
  {
    "id": 373,
    "content": "‘You are,’ said the Sheep: ‘you’re a little goose.’"
  },
  {
    "id": 374,
    "content": "This offended Alice a little, so there was no more conversation for a\n      minute or two, while the boat glided gently on, sometimes among beds of\n      weeds (which made the oars stick fast in the water, worse then ever), and\n      sometimes under trees, but always with the same tall river-banks frowning\n      over their heads."
  },
  {
    "id": 375,
    "content": "‘Oh, please! There are some scented rushes!’ Alice cried in a sudden\n      transport of delight. ‘There really are—and such beauties!’"
  },
  {
    "id": 376,
    "content": "‘You needn’t say “please” to me about ‘em,’ the Sheep said, without\n      looking up from her knitting: ‘I didn’t put ‘em there, and I’m not going\n      to take ‘em away.’"
  },
  {
    "id": 377,
    "content": "‘No, but I meant—please, may we wait and pick some?’ Alice pleaded.\n      ‘If you don’t mind stopping the boat for a minute.’"
  },
  {
    "id": 378,
    "content": "‘How am I to stop it?’ said the Sheep. ‘If you leave off rowing,\n      it’ll stop of itself.’"
  },
  {
    "id": 379,
    "content": "So the boat was left to drift down the stream as it would, till it glided\n      gently in among the waving rushes. And then the little sleeves were\n      carefully rolled up, and the little arms were plunged in elbow-deep to get\n      the rushes a good long way down before breaking them off—and for a\n      while Alice forgot all about the Sheep and the knitting, as she bent over\n      the side of the boat, with just the ends of her tangled hair dipping into\n      the water—while with bright eager eyes she caught at one bunch after\n      another of the darling scented rushes."
  },
  {
    "id": 380,
    "content": "‘I only hope the boat won’t tipple over!’ she said to herself. ‘Oh, what a\n      lovely one! Only I couldn’t quite reach it.’ ‘And it certainly did seem a\n      little provoking (‘almost as if it happened on purpose,’ she thought)\n      that, though she managed to pick plenty of beautiful rushes as the boat\n      glided by, there was always a more lovely one that she couldn’t reach."
  },
  {
    "id": 381,
    "content": "‘The prettiest are always further!’ she said at last, with a sigh at the\n      obstinacy of the rushes in growing so far off, as, with flushed cheeks and\n      dripping hair and hands, she scrambled back into her place, and began to\n      arrange her new-found treasures."
  },
  {
    "id": 382,
    "content": "What mattered it to her just then that the rushes had begun to fade, and\n      to lose all their scent and beauty, from the very moment that she picked\n      them? Even real scented rushes, you know, last only a very little while—and\n      these, being dream-rushes, melted away almost like snow, as they lay in\n      heaps at her feet—but Alice hardly noticed this, there were so many\n      other curious things to think about."
  },
  {
    "id": 383,
    "content": "They hadn’t gone much farther before the blade of one of the oars got fast\n      in the water and wouldn’t come out again (so Alice explained it\n      afterwards), and the consequence was that the handle of it caught her\n      under the chin, and, in spite of a series of little shrieks of ‘Oh, oh,\n      oh!’ from poor Alice, it swept her straight off the seat, and down among\n      the heap of rushes."
  },
  {
    "id": 384,
    "content": "However, she wasn’t hurt, and was soon up again: the Sheep went on with\n      her knitting all the while, just as if nothing had happened. ‘That was a\n      nice crab you caught!’ she remarked, as Alice got back into her place,\n      very much relieved to find herself still in the boat."
  },
  {
    "id": 385,
    "content": "‘Was it? I didn’t see it,’ Said Alice, peeping cautiously over the side of\n      the boat into the dark water. ‘I wish it hadn’t let go—I should so\n      like to see a little crab to take home with me!’ But the Sheep only\n      laughed scornfully, and went on with her knitting."
  },
  {
    "id": 386,
    "content": "‘Are there many crabs here?’ said Alice."
  },
  {
    "id": 387,
    "content": "‘Crabs, and all sorts of things,’ said the Sheep: ‘plenty of choice, only\n      make up your mind. Now, what do you want to buy?’"
  },
  {
    "id": 388,
    "content": "‘To buy!’ Alice echoed in a tone that was half astonished and half\n      frightened—for the oars, and the boat, and the river, had vanished\n      all in a moment, and she was back again in the little dark shop."
  },
  {
    "id": 389,
    "content": "‘I should like to buy an egg, please,’ she said timidly. ‘How do you sell\n      them?’"
  },
  {
    "id": 390,
    "content": "‘Fivepence farthing for one—Twopence for two,’ the Sheep replied."
  },
  {
    "id": 391,
    "content": "‘Then two are cheaper than one?’ Alice said in a surprised tone, taking\n      out her purse."
  },
  {
    "id": 392,
    "content": "‘Only you must eat them both, if you buy two,’ said the Sheep."
  },
  {
    "id": 393,
    "content": "‘Then I’ll have one, please,’ said Alice, as she put the money down on the\n      counter. For she thought to herself, ‘They mightn’t be at all nice, you\n      know.’"
  },
  {
    "id": 394,
    "content": "The Sheep took the money, and put it away in a box: then she said ‘I never\n      put things into people’s hands—that would never do—you must\n      get it for yourself.’ And so saying, she went off to the other end of the\n      shop, and set the egg upright on a shelf."
  },
  {
    "id": 395,
    "content": "‘I wonder why it wouldn’t do?’ thought Alice, as she groped her way among\n      the tables and chairs, for the shop was very dark towards the end. ‘The\n      egg seems to get further away the more I walk towards it. Let me see, is\n      this a chair? Why, it’s got branches, I declare! How very odd to find\n      trees growing here! And actually here’s a little brook! Well, this is the\n      very queerest shop I ever saw!’"
  },
  {
    "id": 396,
    "content": "So she went on, wondering more and more at every step, as everything\n      turned into a tree the moment she came up to it, and she quite expected\n      the egg to do the same."
  },
  {
    "id": 397,
    "content": "However, the egg only got larger and larger, and more and more human: when\n      she had come within a few yards of it, she saw that it had eyes and a nose\n      and mouth; and when she had come close to it, she saw clearly that it was\n      HUMPTY DUMPTY himself. ‘It can’t be anybody else!’ she said to herself.\n      ‘I’m as certain of it, as if his name were written all over his face.’"
  },
  {
    "id": 398,
    "content": "It might have been written a hundred times, easily, on that enormous face.\n      Humpty Dumpty was sitting with his legs crossed, like a Turk, on the top\n      of a high wall—such a narrow one that Alice quite wondered how he\n      could keep his balance—and, as his eyes were steadily fixed in the\n      opposite direction, and he didn’t take the least notice of her, she\n      thought he must be a stuffed figure after all."
  },
  {
    "id": 399,
    "content": "‘And how exactly like an egg he is!’ she said aloud, standing with her\n      hands ready to catch him, for she was every moment expecting him to fall."
  },
  {
    "id": 400,
    "content": "‘It’s very provoking,’ Humpty Dumpty said after a long silence, looking\n      away from Alice as he spoke, ‘to be called an egg—Very!’"
  },
  {
    "id": 401,
    "content": "‘I said you looked like an egg, Sir,’ Alice gently explained. ‘And some\n      eggs are very pretty, you know’ she added, hoping to turn her remark into\n      a sort of a compliment."
  },
  {
    "id": 402,
    "content": "‘Some people,’ said Humpty Dumpty, looking away from her as usual, ‘have\n      no more sense than a baby!’"
  },
  {
    "id": 403,
    "content": "Alice didn’t know what to say to this: it wasn’t at all like conversation,\n      she thought, as he never said anything to her; in fact, his last remark\n      was evidently addressed to a tree—so she stood and softly repeated\n      to herself:—"
  },
  {
    "id": 404,
    "content": "‘That last line is much too long for the poetry,’ she added, almost out\n      loud, forgetting that Humpty Dumpty would hear her."
  },
  {
    "id": 405,
    "content": "‘Don’t stand there chattering to yourself like that,’ Humpty Dumpty said,\n      looking at her for the first time, ‘but tell me your name and your\n      business.’"
  },
  {
    "id": 406,
    "content": "‘My name is Alice, but—’"
  },
  {
    "id": 407,
    "content": "‘It’s a stupid enough name!’ Humpty Dumpty interrupted impatiently. ‘What\n      does it mean?’"
  },
  {
    "id": 408,
    "content": "‘Must a name mean something?’ Alice asked doubtfully."
  },
  {
    "id": 409,
    "content": "‘Of course it must,’ Humpty Dumpty said with a short laugh: ‘my name means\n      the shape I am—and a good handsome shape it is, too. With a name\n      like yours, you might be any shape, almost.’"
  },
  {
    "id": 410,
    "content": "‘Why do you sit out here all alone?’ said Alice, not wishing to begin an\n      argument."
  },
  {
    "id": 411,
    "content": "‘Why, because there’s nobody with me!’ cried Humpty Dumpty. ‘Did you think\n      I didn’t know the answer to that? Ask another.’"
  },
  {
    "id": 412,
    "content": "‘Don’t you think you’d be safer down on the ground?’ Alice went on, not\n      with any idea of making another riddle, but simply in her good-natured\n      anxiety for the queer creature. ‘That wall is so very narrow!’"
  },
  {
    "id": 413,
    "content": "‘What tremendously easy riddles you ask!’ Humpty Dumpty growled out. ‘Of\n      course I don’t think so! Why, if ever I did fall off—which there’s\n      no chance of—but if I did—’ Here he pursed his lips and looked\n      so solemn and grand that Alice could hardly help laughing. ‘If I did\n      fall,’ he went on, ‘The King has promised me—with his very own mouth—to—to—’"
  },
  {
    "id": 414,
    "content": "‘To send all his horses and all his men,’ Alice interrupted, rather\n      unwisely."
  },
  {
    "id": 415,
    "content": "‘Now I declare that’s too bad!’ Humpty Dumpty cried, breaking into a\n      sudden passion. ‘You’ve been listening at doors—and behind trees—and\n      down chimneys—or you couldn’t have known it!’"
  },
  {
    "id": 416,
    "content": "‘I haven’t, indeed!’ Alice said very gently. ‘It’s in a book.’"
  },
  {
    "id": 417,
    "content": "‘Ah, well! They may write such things in a book,’ Humpty Dumpty said in a\n      calmer tone. ‘That’s what you call a History of England, that is. Now,\n      take a good look at me! I’m one that has spoken to a King, I am:\n      mayhap you’ll never see such another: and to show you I’m not proud, you\n      may shake hands with me!’ And he grinned almost from ear to ear, as he\n      leant forwards (and as nearly as possible fell off the wall in doing so)\n      and offered Alice his hand. She watched him a little anxiously as she took\n      it. ‘If he smiled much more, the ends of his mouth might meet behind,’ she\n      thought: ‘and then I don’t know what would happen to his head! I’m afraid\n      it would come off!’"
  },
  {
    "id": 418,
    "content": "‘Yes, all his horses and all his men,’ Humpty Dumpty went on. ‘They’d pick\n      me up again in a minute, they would! However, this conversation is going\n      on a little too fast: let’s go back to the last remark but one.’"
  },
  {
    "id": 419,
    "content": "‘I’m afraid I can’t quite remember it,’ Alice said very politely."
  },
  {
    "id": 420,
    "content": "‘In that case we start fresh,’ said Humpty Dumpty, ‘and it’s my turn to\n      choose a subject—’ (‘He talks about it just as if it was a game!’\n      thought Alice.) ‘So here’s a question for you. How old did you say you\n      were?’"
  },
  {
    "id": 421,
    "content": "Alice made a short calculation, and said ‘Seven years and six months.’"
  },
  {
    "id": 422,
    "content": "‘Wrong!’ Humpty Dumpty exclaimed triumphantly. ‘You never said a word like\n      it!’"
  },
  {
    "id": 423,
    "content": "‘I though you meant “How old are you?”’ Alice explained."
  },
  {
    "id": 424,
    "content": "‘If I’d meant that, I’d have said it,’ said Humpty Dumpty."
  },
  {
    "id": 425,
    "content": "Alice didn’t want to begin another argument, so she said nothing."
  },
  {
    "id": 426,
    "content": "‘Seven years and six months!’ Humpty Dumpty repeated thoughtfully. ‘An\n      uncomfortable sort of age. Now if you’d asked my advice, I’d have said\n      “Leave off at seven”—but it’s too late now.’"
  },
  {
    "id": 427,
    "content": "‘I never ask advice about growing,’ Alice said indignantly."
  },
  {
    "id": 428,
    "content": "‘Too proud?’ the other inquired."
  },
  {
    "id": 429,
    "content": "Alice felt even more indignant at this suggestion. ‘I mean,’ she said,\n      ‘that one can’t help growing older.’"
  },
  {
    "id": 430,
    "content": "‘One can’t, perhaps,’ said Humpty Dumpty, ‘but two can. With proper\n      assistance, you might have left off at seven.’"
  },
  {
    "id": 431,
    "content": "‘What a beautiful belt you’ve got on!’ Alice suddenly remarked."
  },
  {
    "id": 432,
    "content": "(They had had quite enough of the subject of age, she thought: and if they\n      really were to take turns in choosing subjects, it was her turn now.) ‘At\n      least,’ she corrected herself on second thoughts, ‘a beautiful cravat, I\n      should have said—no, a belt, I mean—I beg your pardon!’ she\n      added in dismay, for Humpty Dumpty looked thoroughly offended, and she\n      began to wish she hadn’t chosen that subject. ‘If I only knew,’ she\n      thought to herself, ‘which was neck and which was waist!’"
  },
  {
    "id": 433,
    "content": "Evidently Humpty Dumpty was very angry, though he said nothing for a\n      minute or two. When he did speak again, it was in a deep growl."
  },
  {
    "id": 434,
    "content": "‘It is a—most—provoking—thing,’ he said at last, ‘when a\n      person doesn’t know a cravat from a belt!’"
  },
  {
    "id": 435,
    "content": "‘I know it’s very ignorant of me,’ Alice said, in so humble a tone that\n      Humpty Dumpty relented."
  },
  {
    "id": 436,
    "content": "‘It’s a cravat, child, and a beautiful one, as you say. It’s a present\n      from the White King and Queen. There now!’"
  },
  {
    "id": 437,
    "content": "‘Is it really?’ said Alice, quite pleased to find that she had chosen a\n      good subject, after all."
  },
  {
    "id": 438,
    "content": "‘They gave it me,’ Humpty Dumpty continued thoughtfully, as he crossed one\n      knee over the other and clasped his hands round it, ‘they gave it me—for\n      an un-birthday present.’"
  },
  {
    "id": 439,
    "content": "‘I beg your pardon?’ Alice said with a puzzled air."
  },
  {
    "id": 440,
    "content": "‘I’m not offended,’ said Humpty Dumpty."
  },
  {
    "id": 441,
    "content": "‘I mean, what is an un-birthday present?’"
  },
  {
    "id": 442,
    "content": "‘A present given when it isn’t your birthday, of course.’"
  },
  {
    "id": 443,
    "content": "Alice considered a little. ‘I like birthday presents best,’ she said at\n      last."
  },
  {
    "id": 444,
    "content": "‘You don’t know what you’re talking about!’ cried Humpty Dumpty. ‘How many\n      days are there in a year?’"
  },
  {
    "id": 445,
    "content": "‘Three hundred and sixty-five,’ said Alice."
  },
  {
    "id": 446,
    "content": "‘And how many birthdays have you?’"
  },
  {
    "id": 447,
    "content": "‘One.’"
  },
  {
    "id": 448,
    "content": "‘And if you take one from three hundred and sixty-five, what remains?’"
  },
  {
    "id": 449,
    "content": "‘Three hundred and sixty-four, of course.’"
  },
  {
    "id": 450,
    "content": "Humpty Dumpty looked doubtful. ‘I’d rather see that done on paper,’ he\n      said."
  },
  {
    "id": 451,
    "content": "Alice couldn’t help smiling as she took out her memorandum-book, and\n      worked the sum for him:"
  },
  {
    "id": 452,
    "content": "Humpty Dumpty took the book, and looked at it carefully. ‘That seems to be\n      done right—’ he began."
  },
  {
    "id": 453,
    "content": "‘You’re holding it upside down!’ Alice interrupted."
  },
  {
    "id": 454,
    "content": "‘To be sure I was!’ Humpty Dumpty said gaily, as she turned it round for\n      him. ‘I thought it looked a little queer. As I was saying, that seems to\n      be done right—though I haven’t time to look it over thoroughly just\n      now—and that shows that there are three hundred and sixty-four days\n      when you might get un-birthday presents—’"
  },
  {
    "id": 455,
    "content": "‘Certainly,’ said Alice."
  },
  {
    "id": 456,
    "content": "‘And only one for birthday presents, you know. There’s glory for you!’"
  },
  {
    "id": 457,
    "content": "‘I don’t know what you mean by “glory,”’ Alice said."
  },
  {
    "id": 458,
    "content": "Humpty Dumpty smiled contemptuously. ‘Of course you don’t—till I\n      tell you. I meant “there’s a nice knock-down argument for you!”’"
  },
  {
    "id": 459,
    "content": "‘But “glory” doesn’t mean “a nice knock-down argument,”’ Alice objected."
  },
  {
    "id": 460,
    "content": "‘When I use a word,’ Humpty Dumpty said in rather a scornful tone,\n      ‘it means just what I choose it to mean—neither more nor less.’"
  },
  {
    "id": 461,
    "content": "‘The question is,’ said Alice, ‘whether you can make words mean so many\n      different things.’"
  },
  {
    "id": 462,
    "content": "‘The question is,’ said Humpty Dumpty, ‘which is to be master—that’s\n      all.’"
  },
  {
    "id": 463,
    "content": "Alice was too much puzzled to say anything, so after a minute Humpty\n      Dumpty began again. ‘They’ve a temper, some of them—particularly\n      verbs, they’re the proudest—adjectives you can do anything with, but\n      not verbs—however, I can manage the whole lot of them!\n      Impenetrability! That’s what I say!’"
  },
  {
    "id": 464,
    "content": "‘Would you tell me, please,’ said Alice ‘what that means?’"
  },
  {
    "id": 465,
    "content": "‘Now you talk like a reasonable child,’ said Humpty Dumpty, looking very\n      much pleased. ‘I meant by “impenetrability” that we’ve had enough of that\n      subject, and it would be just as well if you’d mention what you mean to do\n      next, as I suppose you don’t mean to stop here all the rest of your life.’"
  },
  {
    "id": 466,
    "content": "‘That’s a great deal to make one word mean,’ Alice said in a thoughtful\n      tone."
  },
  {
    "id": 467,
    "content": "‘When I make a word do a lot of work like that,’ said Humpty Dumpty, ‘I\n      always pay it extra.’"
  },
  {
    "id": 468,
    "content": "‘Oh!’ said Alice. She was too much puzzled to make any other remark."
  },
  {
    "id": 469,
    "content": "‘Ah, you should see ‘em come round me of a Saturday night,’ Humpty Dumpty\n      went on, wagging his head gravely from side to side: ‘for to get their\n      wages, you know.’"
  },
  {
    "id": 470,
    "content": "(Alice didn’t venture to ask what he paid them with; and so you see I\n      can’t tell you.)"
  },
  {
    "id": 471,
    "content": "‘You seem very clever at explaining words, Sir,’ said Alice. ‘Would you\n      kindly tell me the meaning of the poem called “Jabberwocky”?’"
  },
  {
    "id": 472,
    "content": "‘Let’s hear it,’ said Humpty Dumpty. ‘I can explain all the poems that\n      were ever invented—and a good many that haven’t been invented just\n      yet.’"
  },
  {
    "id": 473,
    "content": "This sounded very hopeful, so Alice repeated the first verse:"
  },
  {
    "id": 474,
    "content": "‘That’s enough to begin with,’ Humpty Dumpty interrupted: ‘there are\n      plenty of hard words there. “Brillig” means four o’clock in the afternoon—the\n      time when you begin broiling things for dinner.’"
  },
  {
    "id": 475,
    "content": "‘That’ll do very well,’ said Alice: ‘and “slithy”?’"
  },
  {
    "id": 476,
    "content": "‘Well, “slithy” means “lithe and slimy.” “Lithe” is the same as “active.”\n       You see it’s like a portmanteau—there are two meanings packed up\n      into one word.’"
  },
  {
    "id": 477,
    "content": "‘I see it now,’ Alice remarked thoughtfully: ‘and what are “toves”?’"
  },
  {
    "id": 478,
    "content": "‘Well, “toves” are something like badgers—they’re something like\n      lizards—and they’re something like corkscrews.’"
  },
  {
    "id": 479,
    "content": "‘They must be very curious looking creatures.’"
  },
  {
    "id": 480,
    "content": "‘They are that,’ said Humpty Dumpty: ‘also they make their nests under\n      sun-dials—also they live on cheese.’"
  },
  {
    "id": 481,
    "content": "‘And what’s the “gyre” and to “gimble”?’"
  },
  {
    "id": 482,
    "content": "‘To “gyre” is to go round and round like a gyroscope. To “gimble” is to\n      make holes like a gimlet.’"
  },
  {
    "id": 483,
    "content": "‘And “the wabe” is the grass-plot round a sun-dial, I suppose?’ said\n      Alice, surprised at her own ingenuity."
  },
  {
    "id": 484,
    "content": "‘Of course it is. It’s called “wabe,” you know, because it goes a long way\n      before it, and a long way behind it—’"
  },
  {
    "id": 485,
    "content": "‘And a long way beyond it on each side,’ Alice added."
  },
  {
    "id": 486,
    "content": "‘Exactly so. Well, then, “mimsy” is “flimsy and miserable” (there’s\n      another portmanteau for you). And a “borogove” is a thin shabby-looking\n      bird with its feathers sticking out all round—something like a live\n      mop.’"
  },
  {
    "id": 487,
    "content": "‘And then “mome raths”?’ said Alice. ‘I’m afraid I’m giving you a great\n      deal of trouble.’"
  },
  {
    "id": 488,
    "content": "‘Well, a “rath” is a sort of green pig: but “mome” I’m not certain about.\n      I think it’s short for “from home”—meaning that they’d lost their\n      way, you know.’"
  },
  {
    "id": 489,
    "content": "‘And what does “outgrabe” mean?’"
  },
  {
    "id": 490,
    "content": "‘Well, “outgrabing” is something between bellowing and whistling, with a\n      kind of sneeze in the middle: however, you’ll hear it done, maybe—down\n      in the wood yonder—and when you’ve once heard it you’ll be quite\n      content. Who’s been repeating all that hard stuff to you?’"
  },
  {
    "id": 491,
    "content": "‘I read it in a book,’ said Alice. ‘But I had some poetry repeated to me,\n      much easier than that, by—Tweedledee, I think it was.’"
  },
  {
    "id": 492,
    "content": "‘As to poetry, you know,’ said Humpty Dumpty, stretching out one of his\n      great hands, ‘I can repeat poetry as well as other folk, if it\n      comes to that—’"
  },
  {
    "id": 493,
    "content": "‘Oh, it needn’t come to that!’ Alice hastily said, hoping to keep him from\n      beginning."
  },
  {
    "id": 494,
    "content": "‘The piece I’m going to repeat,’ he went on without noticing her remark,\n      ‘was written entirely for your amusement.’"
  },
  {
    "id": 495,
    "content": "Alice felt that in that case she really ought to listen to it, so she sat\n      down, and said ‘Thank you’ rather sadly."
  },
  {
    "id": 496,
    "content": "only I don’t sing it,’ he added, as an explanation."
  },
  {
    "id": 497,
    "content": "‘I see you don’t,’ said Alice."
  },
  {
    "id": 498,
    "content": "‘If you can see whether I’m singing or not, you’ve sharper eyes than\n      most.’ Humpty Dumpty remarked severely. Alice was silent."
  },
  {
    "id": 499,
    "content": "‘Thank you very much,’ said Alice."
  },
  {
    "id": 500,
    "content": "‘I will, if I can remember it so long,’ said Alice."
  },
  {
    "id": 501,
    "content": "‘You needn’t go on making remarks like that,’ Humpty Dumpty said: ‘they’re\n      not sensible, and they put me out.’"
  },
  {
    "id": 502,
    "content": "‘I’m afraid I don’t quite understand,’ said Alice."
  },
  {
    "id": 503,
    "content": "‘It gets easier further on,’ Humpty Dumpty replied."
  },
  {
    "id": 504,
    "content": "Humpty Dumpty raised his voice almost to a scream as he repeated this\n      verse, and Alice thought with a shudder, ‘I wouldn’t have been the\n      messenger for anything!’"
  },
  {
    "id": 505,
    "content": "There was a long pause."
  },
  {
    "id": 506,
    "content": "‘Is that all?’ Alice timidly asked."
  },
  {
    "id": 507,
    "content": "‘That’s all,’ said Humpty Dumpty. ‘Good-bye.’"
  },
  {
    "id": 508,
    "content": "This was rather sudden, Alice thought: but, after such a very strong hint\n      that she ought to be going, she felt that it would hardly be civil to\n      stay. So she got up, and held out her hand. ‘Good-bye, till we meet\n      again!’ she said as cheerfully as she could."
  },
  {
    "id": 509,
    "content": "‘I shouldn’t know you again if we did meet,’ Humpty Dumpty replied in a\n      discontented tone, giving her one of his fingers to shake; ‘you’re so\n      exactly like other people.’"
  },
  {
    "id": 510,
    "content": "‘The face is what one goes by, generally,’ Alice remarked in a thoughtful\n      tone."
  },
  {
    "id": 511,
    "content": "‘That’s just what I complain of,’ said Humpty Dumpty. ‘Your face is the\n      same as everybody has—the two eyes, so—’ (marking their places\n      in the air with this thumb) ‘nose in the middle, mouth under. It’s always\n      the same. Now if you had the two eyes on the same side of the nose, for\n      instance—or the mouth at the top—that would be some help.’"
  },
  {
    "id": 512,
    "content": "‘It wouldn’t look nice,’ Alice objected. But Humpty Dumpty only shut his\n      eyes and said ‘Wait till you’ve tried.’"
  },
  {
    "id": 513,
    "content": "Alice waited a minute to see if he would speak again, but as he never\n      opened his eyes or took any further notice of her, she said ‘Good-bye!’\n      once more, and, getting no answer to this, she quietly walked away: but\n      she couldn’t help saying to herself as she went, ‘Of all the\n      unsatisfactory—’ (she repeated this aloud, as it was a great comfort\n      to have such a long word to say) ‘of all the unsatisfactory people I ever\n      met—’ She never finished the sentence, for at this moment a heavy\n      crash shook the forest from end to end."
  },
  {
    "id": 514,
    "content": "The next moment soldiers came running through the wood, at first in twos\n      and threes, then ten or twenty together, and at last in such crowds that\n      they seemed to fill the whole forest. Alice got behind a tree, for fear of\n      being run over, and watched them go by."
  },
  {
    "id": 515,
    "content": "She thought that in all her life she had never seen soldiers so uncertain\n      on their feet: they were always tripping over something or other, and\n      whenever one went down, several more always fell over him, so that the\n      ground was soon covered with little heaps of men."
  },
  {
    "id": 516,
    "content": "Then came the horses. Having four feet, these managed rather better than\n      the foot-soldiers: but even they stumbled now and then; and it seemed to\n      be a regular rule that, whenever a horse stumbled the rider fell off\n      instantly. The confusion got worse every moment, and Alice was very glad\n      to get out of the wood into an open place, where she found the White King\n      seated on the ground, busily writing in his memorandum-book."
  },
  {
    "id": 517,
    "content": "‘I’ve sent them all!’ the King cried in a tone of delight, on seeing\n      Alice. ‘Did you happen to meet any soldiers, my dear, as you came through\n      the wood?’"
  },
  {
    "id": 518,
    "content": "‘Yes, I did,’ said Alice: ‘several thousand, I should think.’"
  },
  {
    "id": 519,
    "content": "‘Four thousand two hundred and seven, that’s the exact number,’ the King\n      said, referring to his book. ‘I couldn’t send all the horses, you know,\n      because two of them are wanted in the game. And I haven’t sent the two\n      Messengers, either. They’re both gone to the town. Just look along the\n      road, and tell me if you can see either of them.’"
  },
  {
    "id": 520,
    "content": "‘I see nobody on the road,’ said Alice."
  },
  {
    "id": 521,
    "content": "‘I only wish I had such eyes,’ the King remarked in a fretful tone.\n      ‘To be able to see Nobody! And at that distance, too! Why, it’s as much as\n      I can do to see real people, by this light!’"
  },
  {
    "id": 522,
    "content": "All this was lost on Alice, who was still looking intently along the road,\n      shading her eyes with one hand. ‘I see somebody now!’ she exclaimed at\n      last. ‘But he’s coming very slowly—and what curious attitudes he\n      goes into!’ (For the messenger kept skipping up and down, and wriggling\n      like an eel, as he came along, with his great hands spread out like fans\n      on each side.)"
  },
  {
    "id": 523,
    "content": "‘Not at all,’ said the King. ‘He’s an Anglo-Saxon Messenger—and\n      those are Anglo-Saxon attitudes. He only does them when he’s happy. His\n      name is Haigha.’ (He pronounced it so as to rhyme with ‘mayor.’)"
  },
  {
    "id": 524,
    "content": "‘I love my love with an H,’ Alice couldn’t help beginning, ‘because he is\n      Happy. I hate him with an H, because he is Hideous. I fed him with—with—with\n      Ham-sandwiches and Hay. His name is Haigha, and he lives—’"
  },
  {
    "id": 525,
    "content": "‘He lives on the Hill,’ the King remarked simply, without the least idea\n      that he was joining in the game, while Alice was still hesitating for the\n      name of a town beginning with H. ‘The other Messenger’s called Hatta. I\n      must have two, you know—to come and go. One to come, and one to go.’"
  },
  {
    "id": 526,
    "content": "‘I beg your pardon?’ said Alice."
  },
  {
    "id": 527,
    "content": "‘It isn’t respectable to beg,’ said the King."
  },
  {
    "id": 528,
    "content": "‘I only meant that I didn’t understand,’ said Alice. ‘Why one to come and\n      one to go?’"
  },
  {
    "id": 529,
    "content": "‘Didn’t I tell you?’ the King repeated impatiently. ‘I must have two—to\n      fetch and carry. One to fetch, and one to carry.’"
  },
  {
    "id": 530,
    "content": "At this moment the Messenger arrived: he was far too much out of breath to\n      say a word, and could only wave his hands about, and make the most fearful\n      faces at the poor King."
  },
  {
    "id": 531,
    "content": "‘This young lady loves you with an H,’ the King said, introducing Alice in\n      the hope of turning off the Messenger’s attention from himself—but\n      it was no use—the Anglo-Saxon attitudes only got more extraordinary\n      every moment, while the great eyes rolled wildly from side to side."
  },
  {
    "id": 532,
    "content": "‘You alarm me!’ said the King. ‘I feel faint—Give me a ham\n      sandwich!’"
  },
  {
    "id": 533,
    "content": "On which the Messenger, to Alice’s great amusement, opened a bag that hung\n      round his neck, and handed a sandwich to the King, who devoured it\n      greedily."
  },
  {
    "id": 534,
    "content": "‘Another sandwich!’ said the King."
  },
  {
    "id": 535,
    "content": "‘There’s nothing but hay left now,’ the Messenger said, peeping into the\n      bag."
  },
  {
    "id": 536,
    "content": "‘Hay, then,’ the King murmured in a faint whisper."
  },
  {
    "id": 537,
    "content": "Alice was glad to see that it revived him a good deal. ‘There’s nothing\n      like eating hay when you’re faint,’ he remarked to her, as he munched\n      away."
  },
  {
    "id": 538,
    "content": "‘I should think throwing cold water over you would be better,’ Alice\n      suggested: ‘or some sal-volatile.’"
  },
  {
    "id": 539,
    "content": "‘I didn’t say there was nothing better,’ the King replied. ‘I said there\n      was nothing like it.’ Which Alice did not venture to deny."
  },
  {
    "id": 540,
    "content": "‘Who did you pass on the road?’ the King went on, holding out his hand to\n      the Messenger for some more hay."
  },
  {
    "id": 541,
    "content": "‘Nobody,’ said the Messenger."
  },
  {
    "id": 542,
    "content": "‘Quite right,’ said the King: ‘this young lady saw him too. So of course\n      Nobody walks slower than you.’"
  },
  {
    "id": 543,
    "content": "‘I do my best,’ the Messenger said in a sulky tone. ‘I’m sure nobody walks\n      much faster than I do!’"
  },
  {
    "id": 544,
    "content": "‘He can’t do that,’ said the King, ‘or else he’d have been here first.\n      However, now you’ve got your breath, you may tell us what’s happened in\n      the town.’"
  },
  {
    "id": 545,
    "content": "‘I’ll whisper it,’ said the Messenger, putting his hands to his mouth in\n      the shape of a trumpet, and stooping so as to get close to the King’s ear.\n      Alice was sorry for this, as she wanted to hear the news too. However,\n      instead of whispering, he simply shouted at the top of his voice ‘They’re\n      at it again!’"
  },
  {
    "id": 546,
    "content": "‘Do you call that a whisper?’ cried the poor King, jumping up and shaking\n      himself. ‘If you do such a thing again, I’ll have you buttered! It went\n      through and through my head like an earthquake!’"
  },
  {
    "id": 547,
    "content": "‘It would have to be a very tiny earthquake!’ thought Alice. ‘Who are at\n      it again?’ she ventured to ask."
  },
  {
    "id": 548,
    "content": "‘Why the Lion and the Unicorn, of course,’ said the King."
  },
  {
    "id": 549,
    "content": "‘Fighting for the crown?’"
  },
  {
    "id": 550,
    "content": "‘Yes, to be sure,’ said the King: ‘and the best of the joke is, that it’s\n      my crown all the while! Let’s run and see them.’ And they trotted off,\n      Alice repeating to herself, as she ran, the words of the old song:—"
  },
  {
    "id": 551,
    "content": "‘Does—the one—that wins—get the crown?’ she asked, as\n      well as she could, for the run was putting her quite out of breath."
  },
  {
    "id": 552,
    "content": "‘Dear me, no!’ said the King. ‘What an idea!’"
  },
  {
    "id": 553,
    "content": "‘Would you—be good enough,’ Alice panted out, after running a little\n      further, ‘to stop a minute—just to get—one’s breath again?’"
  },
  {
    "id": 554,
    "content": "‘I’m good enough,’ the King said, ‘only I’m not strong enough. You see, a\n      minute goes by so fearfully quick. You might as well try to stop a\n      Bandersnatch!’"
  },
  {
    "id": 555,
    "content": "Alice had no more breath for talking, so they trotted on in silence, till\n      they came in sight of a great crowd, in the middle of which the Lion and\n      Unicorn were fighting. They were in such a cloud of dust, that at first\n      Alice could not make out which was which: but she soon managed to\n      distinguish the Unicorn by his horn."
  },
  {
    "id": 556,
    "content": "They placed themselves close to where Hatta, the other messenger, was\n      standing watching the fight, with a cup of tea in one hand and a piece of\n      bread-and-butter in the other."
  },
  {
    "id": 557,
    "content": "‘He’s only just out of prison, and he hadn’t finished his tea when he was\n      sent in,’ Haigha whispered to Alice: ‘and they only give them\n      oyster-shells in there—so you see he’s very hungry and thirsty. How\n      are you, dear child?’ he went on, putting his arm affectionately round\n      Hatta’s neck."
  },
  {
    "id": 558,
    "content": "Hatta looked round and nodded, and went on with his bread and butter."
  },
  {
    "id": 559,
    "content": "‘Were you happy in prison, dear child?’ said Haigha."
  },
  {
    "id": 560,
    "content": "Hatta looked round once more, and this time a tear or two trickled down\n      his cheek: but not a word would he say."
  },
  {
    "id": 561,
    "content": "‘Speak, can’t you!’ Haigha cried impatiently. But Hatta only munched away,\n      and drank some more tea."
  },
  {
    "id": 562,
    "content": "‘Speak, won’t you!’ cried the King. ‘How are they getting on with the\n      fight?’"
  },
  {
    "id": 563,
    "content": "Hatta made a desperate effort, and swallowed a large piece of\n      bread-and-butter. ‘They’re getting on very well,’ he said in a choking\n      voice: ‘each of them has been down about eighty-seven times.’"
  },
  {
    "id": 564,
    "content": "‘Then I suppose they’ll soon bring the white bread and the brown?’ Alice\n      ventured to remark."
  },
  {
    "id": 565,
    "content": "‘It’s waiting for ‘em now,’ said Hatta: ‘this is a bit of it as I’m\n      eating.’"
  },
  {
    "id": 566,
    "content": "There was a pause in the fight just then, and the Lion and the Unicorn sat\n      down, panting, while the King called out ‘Ten minutes allowed for\n      refreshments!’ Haigha and Hatta set to work at once, carrying rough trays\n      of white and brown bread. Alice took a piece to taste, but it was very\n      dry."
  },
  {
    "id": 567,
    "content": "‘I don’t think they’ll fight any more to-day,’ the King said to Hatta: ‘go\n      and order the drums to begin.’ And Hatta went bounding away like a\n      grasshopper."
  },
  {
    "id": 568,
    "content": "For a minute or two Alice stood silent, watching him. Suddenly she\n      brightened up. ‘Look, look!’ she cried, pointing eagerly. ‘There’s the\n      White Queen running across the country! She came flying out of the wood\n      over yonder—How fast those Queens can run!’"
  },
  {
    "id": 569,
    "content": "‘There’s some enemy after her, no doubt,’ the King said, without even\n      looking round. ‘That wood’s full of them.’"
  },
  {
    "id": 570,
    "content": "‘But aren’t you going to run and help her?’ Alice asked, very much\n      surprised at his taking it so quietly."
  },
  {
    "id": 571,
    "content": "‘No use, no use!’ said the King. ‘She runs so fearfully quick. You might\n      as well try to catch a Bandersnatch! But I’ll make a memorandum about her,\n      if you like—She’s a dear good creature,’ he repeated softly to\n      himself, as he opened his memorandum-book. ‘Do you spell “creature” with a\n      double “e”?’"
  },
  {
    "id": 572,
    "content": "At this moment the Unicorn sauntered by them, with his hands in his\n      pockets. ‘I had the best of it this time?’ he said to the King, just\n      glancing at him as he passed."
  },
  {
    "id": 573,
    "content": "‘A little—a little,’ the King replied, rather nervously. ‘You\n      shouldn’t have run him through with your horn, you know.’"
  },
  {
    "id": 574,
    "content": "‘It didn’t hurt him,’ the Unicorn said carelessly, and he was going on,\n      when his eye happened to fall upon Alice: he turned round rather\n      instantly, and stood for some time looking at her with an air of the\n      deepest disgust."
  },
  {
    "id": 575,
    "content": "‘What—is—this?’ he said at last."
  },
  {
    "id": 576,
    "content": "‘This is a child!’ Haigha replied eagerly, coming in front of Alice to\n      introduce her, and spreading out both his hands towards her in an\n      Anglo-Saxon attitude. ‘We only found it to-day. It’s as large as life, and\n      twice as natural!’"
  },
  {
    "id": 577,
    "content": "‘I always thought they were fabulous monsters!’ said the Unicorn. ‘Is it\n      alive?’"
  },
  {
    "id": 578,
    "content": "‘It can talk,’ said Haigha, solemnly."
  },
  {
    "id": 579,
    "content": "The Unicorn looked dreamily at Alice, and said ‘Talk, child.’"
  },
  {
    "id": 580,
    "content": "Alice could not help her lips curling up into a smile as she began: ‘Do\n      you know, I always thought Unicorns were fabulous monsters, too! I never\n      saw one alive before!’"
  },
  {
    "id": 581,
    "content": "‘Well, now that we have seen each other,’ said the Unicorn, ‘if you’ll\n      believe in me, I’ll believe in you. Is that a bargain?’"
  },
  {
    "id": 582,
    "content": "‘Yes, if you like,’ said Alice."
  },
  {
    "id": 583,
    "content": "‘Come, fetch out the plum-cake, old man!’ the Unicorn went on, turning\n      from her to the King. ‘None of your brown bread for me!’"
  },
  {
    "id": 584,
    "content": "‘Certainly—certainly!’ the King muttered, and beckoned to Haigha.\n      ‘Open the bag!’ he whispered. ‘Quick! Not that one—that’s full of\n      hay!’"
  },
  {
    "id": 585,
    "content": "Haigha took a large cake out of the bag, and gave it to Alice to hold,\n      while he got out a dish and carving-knife. How they all came out of it\n      Alice couldn’t guess. It was just like a conjuring-trick, she thought."
  },
  {
    "id": 586,
    "content": "The Lion had joined them while this was going on: he looked very tired and\n      sleepy, and his eyes were half shut. ‘What’s this!’ he said, blinking\n      lazily at Alice, and speaking in a deep hollow tone that sounded like the\n      tolling of a great bell."
  },
  {
    "id": 587,
    "content": "‘Ah, what is it, now?’ the Unicorn cried eagerly. ‘You’ll never guess! I\n      couldn’t.’"
  },
  {
    "id": 588,
    "content": "The Lion looked at Alice wearily. ‘Are you animal—vegetable—or\n      mineral?’ he said, yawning at every other word."
  },
  {
    "id": 589,
    "content": "‘It’s a fabulous monster!’ the Unicorn cried out, before Alice could\n      reply."
  },
  {
    "id": 590,
    "content": "‘Then hand round the plum-cake, Monster,’ the Lion said, lying down and\n      putting his chin on his paws. ‘And sit down, both of you,’ (to the King\n      and the Unicorn): ‘fair play with the cake, you know!’"
  },
  {
    "id": 591,
    "content": "The King was evidently very uncomfortable at having to sit down between\n      the two great creatures; but there was no other place for him."
  },
  {
    "id": 592,
    "content": "‘What a fight we might have for the crown, now!’ the Unicorn said, looking\n      slyly up at the crown, which the poor King was nearly shaking off his\n      head, he trembled so much."
  },
  {
    "id": 593,
    "content": "‘I should win easy,’ said the Lion."
  },
  {
    "id": 594,
    "content": "‘I’m not so sure of that,’ said the Unicorn."
  },
  {
    "id": 595,
    "content": "‘Why, I beat you all round the town, you chicken!’ the Lion replied\n      angrily, half getting up as he spoke."
  },
  {
    "id": 596,
    "content": "Here the King interrupted, to prevent the quarrel going on: he was very\n      nervous, and his voice quite quivered. ‘All round the town?’ he said.\n      ‘That’s a good long way. Did you go by the old bridge, or the\n      market-place? You get the best view by the old bridge.’"
  },
  {
    "id": 597,
    "content": "‘I’m sure I don’t know,’ the Lion growled out as he lay down again. ‘There\n      was too much dust to see anything. What a time the Monster is, cutting up\n      that cake!’"
  },
  {
    "id": 598,
    "content": "Alice had seated herself on the bank of a little brook, with the great\n      dish on her knees, and was sawing away diligently with the knife. ‘It’s\n      very provoking!’ she said, in reply to the Lion (she was getting quite\n      used to being called ‘the Monster’). ‘I’ve cut several slices already, but\n      they always join on again!’"
  },
  {
    "id": 599,
    "content": "‘You don’t know how to manage Looking-glass cakes,’ the Unicorn remarked.\n      ‘Hand it round first, and cut it afterwards.’"
  },
  {
    "id": 600,
    "content": "This sounded nonsense, but Alice very obediently got up, and carried the\n      dish round, and the cake divided itself into three pieces as she did so.\n      ‘Now cut it up,’ said the Lion, as she returned to her place with the\n      empty dish."
  },
  {
    "id": 601,
    "content": "‘I say, this isn’t fair!’ cried the Unicorn, as Alice sat with the knife\n      in her hand, very much puzzled how to begin. ‘The Monster has given the\n      Lion twice as much as me!’"
  },
  {
    "id": 602,
    "content": "‘She’s kept none for herself, anyhow,’ said the Lion. ‘Do you like\n      plum-cake, Monster?’"
  },
  {
    "id": 603,
    "content": "But before Alice could answer him, the drums began."
  },
  {
    "id": 604,
    "content": "Where the noise came from, she couldn’t make out: the air seemed full of\n      it, and it rang through and through her head till she felt quite deafened.\n      She started to her feet and sprang across the little brook in her terror,"
  },
  {
    "id": 605,
    "content": "and had just time to see the Lion and the Unicorn rise to their feet, with\n      angry looks at being interrupted in their feast, before she dropped to her\n      knees, and put her hands over her ears, vainly trying to shut out the\n      dreadful uproar."
  },
  {
    "id": 606,
    "content": "‘If that doesn’t “drum them out of town,”’ she thought to herself,\n      ‘nothing ever will!’"
  },
  {
    "id": 607,
    "content": "After a while the noise seemed gradually to die away, till all was dead\n      silence, and Alice lifted up her head in some alarm. There was no one to\n      be seen, and her first thought was that she must have been dreaming about\n      the Lion and the Unicorn and those queer Anglo-Saxon Messengers. However,\n      there was the great dish still lying at her feet, on which she had tried\n      to cut the plum-cake, ‘So I wasn’t dreaming, after all,’ she said to\n      herself, ‘unless—unless we’re all part of the same dream. Only I do\n      hope it’s my dream, and not the Red King’s! I don’t like belonging to\n      another person’s dream,’ she went on in a rather complaining tone: ‘I’ve a\n      great mind to go and wake him, and see what happens!’"
  },
  {
    "id": 608,
    "content": "At this moment her thoughts were interrupted by a loud shouting of ‘Ahoy!\n      Ahoy! Check!’ and a Knight dressed in crimson armour came galloping down\n      upon her, brandishing a great club. Just as he reached her, the horse\n      stopped suddenly: ‘You’re my prisoner!’ the Knight cried, as he tumbled\n      off his horse."
  },
  {
    "id": 609,
    "content": "Startled as she was, Alice was more frightened for him than for herself at\n      the moment, and watched him with some anxiety as he mounted again. As soon\n      as he was comfortably in the saddle, he began once more ‘You’re my—’\n      but here another voice broke in ‘Ahoy! Ahoy! Check!’ and Alice looked\n      round in some surprise for the new enemy."
  },
  {
    "id": 610,
    "content": "This time it was a White Knight. He drew up at Alice’s side, and tumbled\n      off his horse just as the Red Knight had done: then he got on again, and\n      the two Knights sat and looked at each other for some time without\n      speaking. Alice looked from one to the other in some bewilderment."
  },
  {
    "id": 611,
    "content": "‘She’s my prisoner, you know!’ the Red Knight said at last."
  },
  {
    "id": 612,
    "content": "‘Yes, but then I came and rescued her!’ the White Knight replied."
  },
  {
    "id": 613,
    "content": "‘Well, we must fight for her, then,’ said the Red Knight, as he took up\n      his helmet (which hung from the saddle, and was something the shape of a\n      horse’s head), and put it on."
  },
  {
    "id": 614,
    "content": "‘You will observe the Rules of Battle, of course?’ the White Knight\n      remarked, putting on his helmet too."
  },
  {
    "id": 615,
    "content": "‘I always do,’ said the Red Knight, and they began banging away at each\n      other with such fury that Alice got behind a tree to be out of the way of\n      the blows."
  },
  {
    "id": 616,
    "content": "‘I wonder, now, what the Rules of Battle are,’ she said to herself, as she\n      watched the fight, timidly peeping out from her hiding-place: ‘one Rule\n      seems to be, that if one Knight hits the other, he knocks him off his\n      horse, and if he misses, he tumbles off himself—and another Rule\n      seems to be that they hold their clubs with their arms, as if they were\n      Punch and Judy—What a noise they make when they tumble! Just like a\n      whole set of fire-irons falling into the fender! And how quiet the horses\n      are! They let them get on and off them just as if they were tables!’"
  },
  {
    "id": 617,
    "content": "Another Rule of Battle, that Alice had not noticed, seemed to be that they\n      always fell on their heads, and the battle ended with their both falling\n      off in this way, side by side: when they got up again, they shook hands,\n      and then the Red Knight mounted and galloped off."
  },
  {
    "id": 618,
    "content": "‘It was a glorious victory, wasn’t it?’ said the White Knight, as he came\n      up panting."
  },
  {
    "id": 619,
    "content": "‘I don’t know,’ Alice said doubtfully. ‘I don’t want to be anybody’s\n      prisoner. I want to be a Queen.’"
  },
  {
    "id": 620,
    "content": "‘So you will, when you’ve crossed the next brook,’ said the White Knight.\n      ‘I’ll see you safe to the end of the wood—and then I must go back,\n      you know. That’s the end of my move.’"
  },
  {
    "id": 621,
    "content": "‘Thank you very much,’ said Alice. ‘May I help you off with your helmet?’\n      It was evidently more than he could manage by himself; however, she\n      managed to shake him out of it at last."
  },
  {
    "id": 622,
    "content": "‘Now one can breathe more easily,’ said the Knight, putting back his\n      shaggy hair with both hands, and turning his gentle face and large mild\n      eyes to Alice. She thought she had never seen such a strange-looking\n      soldier in all her life."
  },
  {
    "id": 623,
    "content": "He was dressed in tin armour, which seemed to fit him very badly, and he\n      had a queer-shaped little deal box fastened across his shoulder,\n      upside-down, and with the lid hanging open. Alice looked at it with great\n      curiosity."
  },
  {
    "id": 624,
    "content": "‘I see you’re admiring my little box.’ the Knight said in a friendly tone.\n      ‘It’s my own invention—to keep clothes and sandwiches in. You see I\n      carry it upside-down, so that the rain can’t get in.’"
  },
  {
    "id": 625,
    "content": "‘But the things can get out,’ Alice gently remarked. ‘Do you know the\n      lid’s open?’"
  },
  {
    "id": 626,
    "content": "‘I didn’t know it,’ the Knight said, a shade of vexation passing over his\n      face. ‘Then all the things must have fallen out! And the box is no use\n      without them.’ He unfastened it as he spoke, and was just going to throw\n      it into the bushes, when a sudden thought seemed to strike him, and he\n      hung it carefully on a tree. ‘Can you guess why I did that?’ he said to\n      Alice."
  },
  {
    "id": 627,
    "content": "Alice shook her head."
  },
  {
    "id": 628,
    "content": "‘In hopes some bees may make a nest in it—then I should get the\n      honey.’"
  },
  {
    "id": 629,
    "content": "‘But you’ve got a bee-hive—or something like one—fastened to\n      the saddle,’ said Alice."
  },
  {
    "id": 630,
    "content": "‘Yes, it’s a very good bee-hive,’ the Knight said in a discontented tone,\n      ‘one of the best kind. But not a single bee has come near it yet. And the\n      other thing is a mouse-trap. I suppose the mice keep the bees out—or\n      the bees keep the mice out, I don’t know which.’"
  },
  {
    "id": 631,
    "content": "‘I was wondering what the mouse-trap was for,’ said Alice. ‘It isn’t very\n      likely there would be any mice on the horse’s back.’"
  },
  {
    "id": 632,
    "content": "‘Not very likely, perhaps,’ said the Knight: ‘but if they do come, I don’t\n      choose to have them running all about.’"
  },
  {
    "id": 633,
    "content": "‘You see,’ he went on after a pause, ‘it’s as well to be provided for\n      everything. That’s the reason the horse has all those anklets round his\n      feet.’"
  },
  {
    "id": 634,
    "content": "‘But what are they for?’ Alice asked in a tone of great curiosity."
  },
  {
    "id": 635,
    "content": "‘To guard against the bites of sharks,’ the Knight replied. ‘It’s an\n      invention of my own. And now help me on. I’ll go with you to the end of\n      the wood—What’s the dish for?’"
  },
  {
    "id": 636,
    "content": "‘It’s meant for plum-cake,’ said Alice."
  },
  {
    "id": 637,
    "content": "‘We’d better take it with us,’ the Knight said. ‘It’ll come in handy if we\n      find any plum-cake. Help me to get it into this bag.’"
  },
  {
    "id": 638,
    "content": "This took a very long time to manage, though Alice held the bag open very\n      carefully, because the Knight was so very awkward in putting in the dish:\n      the first two or three times that he tried he fell in himself instead.\n      ‘It’s rather a tight fit, you see,’ he said, as they got it in a last;\n      ‘There are so many candlesticks in the bag.’ And he hung it to the saddle,\n      which was already loaded with bunches of carrots, and fire-irons, and many\n      other things."
  },
  {
    "id": 639,
    "content": "‘I hope you’ve got your hair well fastened on?’ he continued, as they set\n      off."
  },
  {
    "id": 640,
    "content": "‘Only in the usual way,’ Alice said, smiling."
  },
  {
    "id": 641,
    "content": "‘That’s hardly enough,’ he said, anxiously. ‘You see the wind is so very\n      strong here. It’s as strong as soup.’"
  },
  {
    "id": 642,
    "content": "‘Have you invented a plan for keeping the hair from being blown off?’\n      Alice enquired."
  },
  {
    "id": 643,
    "content": "‘Not yet,’ said the Knight. ‘But I’ve got a plan for keeping it from\n      falling off.’"
  },
  {
    "id": 644,
    "content": "‘I should like to hear it, very much.’"
  },
  {
    "id": 645,
    "content": "‘First you take an upright stick,’ said the Knight. ‘Then you make your\n      hair creep up it, like a fruit-tree. Now the reason hair falls off is\n      because it hangs down—things never fall upwards, you know. It’s a\n      plan of my own invention. You may try it if you like.’"
  },
  {
    "id": 646,
    "content": "It didn’t sound a comfortable plan, Alice thought, and for a few minutes\n      she walked on in silence, puzzling over the idea, and every now and then\n      stopping to help the poor Knight, who certainly was not a good rider."
  },
  {
    "id": 647,
    "content": "Whenever the horse stopped (which it did very often), he fell off in\n      front; and whenever it went on again (which it generally did rather\n      suddenly), he fell off behind. Otherwise he kept on pretty well, except\n      that he had a habit of now and then falling off sideways; and as he\n      generally did this on the side on which Alice was walking, she soon found\n      that it was the best plan not to walk quite close to the horse."
  },
  {
    "id": 648,
    "content": "‘I’m afraid you’ve not had much practice in riding,’ she ventured to say,\n      as she was helping him up from his fifth tumble."
  },
  {
    "id": 649,
    "content": "The Knight looked very much surprised, and a little offended at the\n      remark. ‘What makes you say that?’ he asked, as he scrambled back into the\n      saddle, keeping hold of Alice’s hair with one hand, to save himself from\n      falling over on the other side."
  },
  {
    "id": 650,
    "content": "‘Because people don’t fall off quite so often, when they’ve had much\n      practice.’"
  },
  {
    "id": 651,
    "content": "‘I’ve had plenty of practice,’ the Knight said very gravely: ‘plenty of\n      practice!’"
  },
  {
    "id": 652,
    "content": "Alice could think of nothing better to say than ‘Indeed?’ but she said it\n      as heartily as she could. They went on a little way in silence after this,\n      the Knight with his eyes shut, muttering to himself, and Alice watching\n      anxiously for the next tumble."
  },
  {
    "id": 653,
    "content": "‘The great art of riding,’ the Knight suddenly began in a loud voice,\n      waving his right arm as he spoke, ‘is to keep—’ Here the sentence\n      ended as suddenly as it had begun, as the Knight fell heavily on the top\n      of his head exactly in the path where Alice was walking. She was quite\n      frightened this time, and said in an anxious tone, as she picked him up,\n      ‘I hope no bones are broken?’"
  },
  {
    "id": 654,
    "content": "‘None to speak of,’ the Knight said, as if he didn’t mind breaking two or\n      three of them. ‘The great art of riding, as I was saying, is—to keep\n      your balance properly. Like this, you know—’"
  },
  {
    "id": 655,
    "content": "He let go the bridle, and stretched out both his arms to show Alice what\n      he meant, and this time he fell flat on his back, right under the horse’s\n      feet."
  },
  {
    "id": 656,
    "content": "‘Plenty of practice!’ he went on repeating, all the time that Alice was\n      getting him on his feet again. ‘Plenty of practice!’"
  },
  {
    "id": 657,
    "content": "‘It’s too ridiculous!’ cried Alice, losing all her patience this time.\n      ‘You ought to have a wooden horse on wheels, that you ought!’"
  },
  {
    "id": 658,
    "content": "‘Does that kind go smoothly?’ the Knight asked in a tone of great\n      interest, clasping his arms round the horse’s neck as he spoke, just in\n      time to save himself from tumbling off again."
  },
  {
    "id": 659,
    "content": "‘Much more smoothly than a live horse,’ Alice said, with a little scream\n      of laughter, in spite of all she could do to prevent it."
  },
  {
    "id": 660,
    "content": "‘I’ll get one,’ the Knight said thoughtfully to himself. ‘One or two—several.’"
  },
  {
    "id": 661,
    "content": "There was a short silence after this, and then the Knight went on again.\n      ‘I’m a great hand at inventing things. Now, I daresay you noticed, that\n      last time you picked me up, that I was looking rather thoughtful?’"
  },
  {
    "id": 662,
    "content": "‘You were a little grave,’ said Alice."
  },
  {
    "id": 663,
    "content": "‘Well, just then I was inventing a new way of getting over a gate—would\n      you like to hear it?’"
  },
  {
    "id": 664,
    "content": "‘Very much indeed,’ Alice said politely."
  },
  {
    "id": 665,
    "content": "‘I’ll tell you how I came to think of it,’ said the Knight. ‘You see, I\n      said to myself, “The only difficulty is with the feet: the head is high\n      enough already.” Now, first I put my head on the top of the gate—then\n      I stand on my head—then the feet are high enough, you see—then\n      I’m over, you see.’"
  },
  {
    "id": 666,
    "content": "‘Yes, I suppose you’d be over when that was done,’ Alice said\n      thoughtfully: ‘but don’t you think it would be rather hard?’"
  },
  {
    "id": 667,
    "content": "‘I haven’t tried it yet,’ the Knight said, gravely: ‘so I can’t tell for\n      certain—but I’m afraid it would be a little hard.’"
  },
  {
    "id": 668,
    "content": "He looked so vexed at the idea, that Alice changed the subject hastily.\n      ‘What a curious helmet you’ve got!’ she said cheerfully. ‘Is that your\n      invention too?’"
  },
  {
    "id": 669,
    "content": "The Knight looked down proudly at his helmet, which hung from the saddle.\n      ‘Yes,’ he said, ‘but I’ve invented a better one than that—like a\n      sugar loaf. When I used to wear it, if I fell off the horse, it always\n      touched the ground directly. So I had a very little way to fall, you see—But\n      there was the danger of falling into it, to be sure. That happened to me\n      once—and the worst of it was, before I could get out again, the\n      other White Knight came and put it on. He thought it was his own helmet.’"
  },
  {
    "id": 670,
    "content": "The knight looked so solemn about it that Alice did not dare to laugh.\n      ‘I’m afraid you must have hurt him,’ she said in a trembling voice, ‘being\n      on the top of his head.’"
  },
  {
    "id": 671,
    "content": "‘I had to kick him, of course,’ the Knight said, very seriously. ‘And then\n      he took the helmet off again—but it took hours and hours to get me\n      out. I was as fast as—as lightning, you know.’"
  },
  {
    "id": 672,
    "content": "‘But that’s a different kind of fastness,’ Alice objected."
  },
  {
    "id": 673,
    "content": "The Knight shook his head. ‘It was all kinds of fastness with me, I can\n      assure you!’ he said. He raised his hands in some excitement as he said\n      this, and instantly rolled out of the saddle, and fell headlong into a\n      deep ditch."
  },
  {
    "id": 674,
    "content": "Alice ran to the side of the ditch to look for him. She was rather\n      startled by the fall, as for some time he had kept on very well, and she\n      was afraid that he really was hurt this time. However, though she could\n      see nothing but the soles of his feet, she was much relieved to hear that\n      he was talking on in his usual tone. ‘All kinds of fastness,’ he repeated:\n      ‘but it was careless of him to put another man’s helmet on—with the\n      man in it, too.’"
  },
  {
    "id": 675,
    "content": "‘How can you go on talking so quietly, head downwards?’ Alice asked, as\n      she dragged him out by the feet, and laid him in a heap on the bank."
  },
  {
    "id": 676,
    "content": "The Knight looked surprised at the question. ‘What does it matter where my\n      body happens to be?’ he said. ‘My mind goes on working all the same. In\n      fact, the more head downwards I am, the more I keep inventing new things.’"
  },
  {
    "id": 677,
    "content": "‘Now the cleverest thing of the sort that I ever did,’ he went on after a\n      pause, ‘was inventing a new pudding during the meat-course.’"
  },
  {
    "id": 678,
    "content": "‘In time to have it cooked for the next course?’ said Alice. ‘Well, not\n      the next course,’ the Knight said in a slow thoughtful tone: ‘no,\n      certainly not the next course.’"
  },
  {
    "id": 679,
    "content": "‘Then it would have to be the next day. I suppose you wouldn’t have two\n      pudding-courses in one dinner?’"
  },
  {
    "id": 680,
    "content": "‘Well, not the next day,’ the Knight repeated as before: ‘not the next\n      day. In fact,’ he went on, holding his head down, and his voice getting\n      lower and lower, ‘I don’t believe that pudding ever was cooked! In fact, I\n      don’t believe that pudding ever will be cooked! And yet it was a very\n      clever pudding to invent.’"
  },
  {
    "id": 681,
    "content": "‘What did you mean it to be made of?’ Alice asked, hoping to cheer him up,\n      for the poor Knight seemed quite low-spirited about it."
  },
  {
    "id": 682,
    "content": "‘It began with blotting paper,’ the Knight answered with a groan."
  },
  {
    "id": 683,
    "content": "‘That wouldn’t be very nice, I’m afraid—’"
  },
  {
    "id": 684,
    "content": "‘Not very nice alone,’ he interrupted, quite eagerly: ‘but you’ve no idea\n      what a difference it makes mixing it with other things—such as\n      gunpowder and sealing-wax. And here I must leave you.’ They had just come\n      to the end of the wood."
  },
  {
    "id": 685,
    "content": "Alice could only look puzzled: she was thinking of the pudding."
  },
  {
    "id": 686,
    "content": "‘You are sad,’ the Knight said in an anxious tone: ‘let me sing you a song\n      to comfort you.’"
  },
  {
    "id": 687,
    "content": "‘Is it very long?’ Alice asked, for she had heard a good deal of poetry\n      that day."
  },
  {
    "id": 688,
    "content": "‘It’s long,’ said the Knight, ‘but very, very beautiful. Everybody that\n      hears me sing it—either it brings the tears into their eyes, or else—’"
  },
  {
    "id": 689,
    "content": "‘Or else what?’ said Alice, for the Knight had made a sudden pause."
  },
  {
    "id": 690,
    "content": "‘Or else it doesn’t, you know. The name of the song is called “Haddocks’\n      Eyes.”’"
  },
  {
    "id": 691,
    "content": "‘Oh, that’s the name of the song, is it?’ Alice said, trying to feel\n      interested."
  },
  {
    "id": 692,
    "content": "‘No, you don’t understand,’ the Knight said, looking a little vexed.\n      ‘That’s what the name is called. The name really is “The Aged Aged Man.”’"
  },
  {
    "id": 693,
    "content": "‘Then I ought to have said “That’s what the song is called”?’ Alice\n      corrected herself."
  },
  {
    "id": 694,
    "content": "‘No, you oughtn’t: that’s quite another thing! The song is called “Ways\n      and Means”: but that’s only what it’s called, you know!’"
  },
  {
    "id": 695,
    "content": "‘Well, what is the song, then?’ said Alice, who was by this time\n      completely bewildered."
  },
  {
    "id": 696,
    "content": "‘I was coming to that,’ the Knight said. ‘The song really is “A-sitting On\n      A Gate”: and the tune’s my own invention.’"
  },
  {
    "id": 697,
    "content": "So saying, he stopped his horse and let the reins fall on its neck: then,\n      slowly beating time with one hand, and with a faint smile lighting up his\n      gentle foolish face, as if he enjoyed the music of his song, he began."
  },
  {
    "id": 698,
    "content": "Of all the strange things that Alice saw in her journey Through The\n      Looking-Glass, this was the one that she always remembered most clearly.\n      Years afterwards she could bring the whole scene back again, as if it had\n      been only yesterday—the mild blue eyes and kindly smile of the\n      Knight—the setting sun gleaming through his hair, and shining on his\n      armour in a blaze of light that quite dazzled her—the horse quietly\n      moving about, with the reins hanging loose on his neck, cropping the grass\n      at her feet—and the black shadows of the forest behind—all\n      this she took in like a picture, as, with one hand shading her eyes, she\n      leant against a tree, watching the strange pair, and listening, in a half\n      dream, to the melancholy music of the song."
  },
  {
    "id": 699,
    "content": "‘But the tune isn’t his own invention,’ she said to herself: ‘it’s “I give\n      thee all, I can no more.”’ She stood and listened very attentively, but no\n      tears came into her eyes."
  },
  {
    "id": 700,
    "content": "As the Knight sang the last words of the ballad, he gathered up the reins,\n      and turned his horse’s head along the road by which they had come. ‘You’ve\n      only a few yards to go,’ he said, ‘down the hill and over that little\n      brook, and then you’ll be a Queen—But you’ll stay and see me off\n      first?’ he added as Alice turned with an eager look in the direction to\n      which he pointed. ‘I shan’t be long. You’ll wait and wave your\n      handkerchief when I get to that turn in the road? I think it’ll encourage\n      me, you see.’"
  },
  {
    "id": 701,
    "content": "‘Of course I’ll wait,’ said Alice: ‘and thank you very much for coming so\n      far—and for the song—I liked it very much.’"
  },
  {
    "id": 702,
    "content": "‘I hope so,’ the Knight said doubtfully: ‘but you didn’t cry so much as I\n      thought you would.’"
  },
  {
    "id": 703,
    "content": "So they shook hands, and then the Knight rode slowly away into the forest.\n      ‘It won’t take long to see him off, I expect,’ Alice said to herself, as\n      she stood watching him. ‘There he goes! Right on his head as usual!\n      However, he gets on again pretty easily—that comes of having so many\n      things hung round the horse—’ So she went on talking to herself, as\n      she watched the horse walking leisurely along the road, and the Knight\n      tumbling off, first on one side and then on the other. After the fourth or\n      fifth tumble he reached the turn, and then she waved her handkerchief to\n      him, and waited till he was out of sight."
  },
  {
    "id": 704,
    "content": "‘I hope it encouraged him,’ she said, as she turned to run down the hill:\n      ‘and now for the last brook, and to be a Queen! How grand it sounds!’ A\n      very few steps brought her to the edge of the brook. ‘The Eighth Square at\n      last!’ she cried as she bounded across,"
  },
  {
    "id": 705,
    "content": "and threw herself down to rest on a lawn as soft as moss, with little\n      flower-beds dotted about it here and there. ‘Oh, how glad I am to get\n      here! And what is this on my head?’ she exclaimed in a tone of dismay, as\n      she put her hands up to something very heavy, and fitted tight all round\n      her head."
  },
  {
    "id": 706,
    "content": "‘But how can it have got there without my knowing it?’ she said to\n      herself, as she lifted it off, and set it on her lap to make out what it\n      could possibly be."
  },
  {
    "id": 707,
    "content": "It was a golden crown."
  },
  {
    "id": 708,
    "content": "‘Well, this is grand!’ said Alice. ‘I never expected I should be a Queen\n      so soon—and I’ll tell you what it is, your majesty,’ she went on in\n      a severe tone (she was always rather fond of scolding herself), ‘it’ll\n      never do for you to be lolling about on the grass like that! Queens have\n      to be dignified, you know!’"
  },
  {
    "id": 709,
    "content": "So she got up and walked about—rather stiffly just at first, as she\n      was afraid that the crown might come off: but she comforted herself with\n      the thought that there was nobody to see her, ‘and if I really am a\n      Queen,’ she said as she sat down again, ‘I shall be able to manage it\n      quite well in time.’"
  },
  {
    "id": 710,
    "content": "Everything was happening so oddly that she didn’t feel a bit surprised at\n      finding the Red Queen and the White Queen sitting close to her, one on\n      each side: she would have liked very much to ask them how they came there,\n      but she feared it would not be quite civil. However, there would be no\n      harm, she thought, in asking if the game was over. ‘Please, would you tell\n      me—’ she began, looking timidly at the Red Queen."
  },
  {
    "id": 711,
    "content": "‘Speak when you’re spoken to!’ The Queen sharply interrupted her."
  },
  {
    "id": 712,
    "content": "‘But if everybody obeyed that rule,’ said Alice, who was always ready for\n      a little argument, ‘and if you only spoke when you were spoken to, and the\n      other person always waited for you to begin, you see nobody would ever say\n      anything, so that—’"
  },
  {
    "id": 713,
    "content": "‘Ridiculous!’ cried the Queen. ‘Why, don’t you see, child—’ here she\n      broke off with a frown, and, after thinking for a minute, suddenly changed\n      the subject of the conversation. ‘What do you mean by “If you really are a\n      Queen”? What right have you to call yourself so? You can’t be a Queen, you\n      know, till you’ve passed the proper examination. And the sooner we begin\n      it, the better.’"
  },
  {
    "id": 714,
    "content": "‘I only said “if”!’ poor Alice pleaded in a piteous tone."
  },
  {
    "id": 715,
    "content": "The two Queens looked at each other, and the Red Queen remarked, with a\n      little shudder, ‘She says she only said “if”—’"
  },
  {
    "id": 716,
    "content": "‘But she said a great deal more than that!’ the White Queen moaned,\n      wringing her hands. ‘Oh, ever so much more than that!’"
  },
  {
    "id": 717,
    "content": "‘So you did, you know,’ the Red Queen said to Alice. ‘Always speak the\n      truth—think before you speak—and write it down afterwards.’"
  },
  {
    "id": 718,
    "content": "‘I’m sure I didn’t mean—’ Alice was beginning, but the Red Queen\n      interrupted her impatiently."
  },
  {
    "id": 719,
    "content": "‘That’s just what I complain of! You should have meant! What do you\n      suppose is the use of child without any meaning? Even a joke should have\n      some meaning—and a child’s more important than a joke, I hope. You\n      couldn’t deny that, even if you tried with both hands.’"
  },
  {
    "id": 720,
    "content": "‘I don’t deny things with my hands,’ Alice objected."
  },
  {
    "id": 721,
    "content": "‘Nobody said you did,’ said the Red Queen. ‘I said you couldn’t if you\n      tried.’"
  },
  {
    "id": 722,
    "content": "‘She’s in that state of mind,’ said the White Queen, ‘that she wants to\n      deny something—only she doesn’t know what to deny!’"
  },
  {
    "id": 723,
    "content": "‘A nasty, vicious temper,’ the Red Queen remarked; and then there was an\n      uncomfortable silence for a minute or two."
  },
  {
    "id": 724,
    "content": "The Red Queen broke the silence by saying to the White Queen, ‘I invite\n      you to Alice’s dinner-party this afternoon.’"
  },
  {
    "id": 725,
    "content": "The White Queen smiled feebly, and said ‘And I invite you.’"
  },
  {
    "id": 726,
    "content": "‘I didn’t know I was to have a party at all,’ said Alice; ‘but if there is\n      to be one, I think I ought to invite the guests.’"
  },
  {
    "id": 727,
    "content": "‘We gave you the opportunity of doing it,’ the Red Queen remarked: ‘but I\n      daresay you’ve not had many lessons in manners yet?’"
  },
  {
    "id": 728,
    "content": "‘Manners are not taught in lessons,’ said Alice. ‘Lessons teach you to do\n      sums, and things of that sort.’"
  },
  {
    "id": 729,
    "content": "‘And you do Addition?’ the White Queen asked. ‘What’s one and one and one\n      and one and one and one and one and one and one and one?’"
  },
  {
    "id": 730,
    "content": "‘I don’t know,’ said Alice. ‘I lost count.’"
  },
  {
    "id": 731,
    "content": "‘She can’t do Addition,’ the Red Queen interrupted. ‘Can you do\n      Subtraction? Take nine from eight.’"
  },
  {
    "id": 732,
    "content": "‘Nine from eight I can’t, you know,’ Alice replied very readily: ‘but—’"
  },
  {
    "id": 733,
    "content": "‘She can’t do Subtraction,’ said the White Queen. ‘Can you do Division?\n      Divide a loaf by a knife—what’s the answer to that?’"
  },
  {
    "id": 734,
    "content": "‘I suppose—’ Alice was beginning, but the Red Queen answered for\n      her. ‘Bread-and-butter, of course. Try another Subtraction sum. Take a\n      bone from a dog: what remains?’"
  },
  {
    "id": 735,
    "content": "Alice considered. ‘The bone wouldn’t remain, of course, if I took it—and\n      the dog wouldn’t remain; it would come to bite me—and I’m sure I\n      shouldn’t remain!’"
  },
  {
    "id": 736,
    "content": "‘Then you think nothing would remain?’ said the Red Queen."
  },
  {
    "id": 737,
    "content": "‘I think that’s the answer.’"
  },
  {
    "id": 738,
    "content": "‘Wrong, as usual,’ said the Red Queen: ‘the dog’s temper would remain.’"
  },
  {
    "id": 739,
    "content": "‘But I don’t see how—’"
  },
  {
    "id": 740,
    "content": "‘Why, look here!’ the Red Queen cried. ‘The dog would lose its temper,\n      wouldn’t it?’"
  },
  {
    "id": 741,
    "content": "‘Perhaps it would,’ Alice replied cautiously."
  },
  {
    "id": 742,
    "content": "‘Then if the dog went away, its temper would remain!’ the Queen exclaimed\n      triumphantly."
  },
  {
    "id": 743,
    "content": "Alice said, as gravely as she could, ‘They might go different ways.’ But\n      she couldn’t help thinking to herself, ‘What dreadful nonsense we are\n      talking!’"
  },
  {
    "id": 744,
    "content": "‘She can’t do sums a bit!’ the Queens said together, with great emphasis."
  },
  {
    "id": 745,
    "content": "‘Can you do sums?’ Alice said, turning suddenly on the White Queen, for\n      she didn’t like being found fault with so much."
  },
  {
    "id": 746,
    "content": "The Queen gasped and shut her eyes. ‘I can do Addition, if you give me\n      time—but I can’t do Subtraction, under any circumstances!’"
  },
  {
    "id": 747,
    "content": "‘Of course you know your A B C?’ said the Red Queen."
  },
  {
    "id": 748,
    "content": "‘To be sure I do.’ said Alice."
  },
  {
    "id": 749,
    "content": "‘So do I,’ the White Queen whispered: ‘we’ll often say it over together,\n      dear. And I’ll tell you a secret—I can read words of one letter!\n      Isn’t that grand! However, don’t be discouraged. You’ll come to it in\n      time.’"
  },
  {
    "id": 750,
    "content": "Here the Red Queen began again. ‘Can you answer useful questions?’ she\n      said. ‘How is bread made?’"
  },
  {
    "id": 751,
    "content": "‘I know that!’ Alice cried eagerly. ‘You take some flour—’"
  },
  {
    "id": 752,
    "content": "‘Where do you pick the flower?’ the White Queen asked. ‘In a garden, or in\n      the hedges?’"
  },
  {
    "id": 753,
    "content": "‘Well, it isn’t picked at all,’ Alice explained: ‘it’s ground—’"
  },
  {
    "id": 754,
    "content": "‘How many acres of ground?’ said the White Queen. ‘You mustn’t leave out\n      so many things.’"
  },
  {
    "id": 755,
    "content": "‘Fan her head!’ the Red Queen anxiously interrupted. ‘She’ll be feverish\n      after so much thinking.’ So they set to work and fanned her with bunches\n      of leaves, till she had to beg them to leave off, it blew her hair about\n      so."
  },
  {
    "id": 756,
    "content": "‘She’s all right again now,’ said the Red Queen. ‘Do you know Languages?\n      What’s the French for fiddle-de-dee?’"
  },
  {
    "id": 757,
    "content": "‘Fiddle-de-dee’s not English,’ Alice replied gravely."
  },
  {
    "id": 758,
    "content": "‘Who ever said it was?’ said the Red Queen."
  },
  {
    "id": 759,
    "content": "Alice thought she saw a way out of the difficulty this time. ‘If you’ll\n      tell me what language “fiddle-de-dee” is, I’ll tell you the French for\n      it!’ she exclaimed triumphantly."
  },
  {
    "id": 760,
    "content": "But the Red Queen drew herself up rather stiffly, and said ‘Queens never\n      make bargains.’"
  },
  {
    "id": 761,
    "content": "‘I wish Queens never asked questions,’ Alice thought to herself."
  },
  {
    "id": 762,
    "content": "‘Don’t let us quarrel,’ the White Queen said in an anxious tone. ‘What is\n      the cause of lightning?’"
  },
  {
    "id": 763,
    "content": "‘The cause of lightning,’ Alice said very decidedly, for she felt quite\n      certain about this, ‘is the thunder—no, no!’ she hastily corrected\n      herself. ‘I meant the other way.’"
  },
  {
    "id": 764,
    "content": "‘It’s too late to correct it,’ said the Red Queen: ‘when you’ve once said\n      a thing, that fixes it, and you must take the consequences.’"
  },
  {
    "id": 765,
    "content": "‘Which reminds me—’ the White Queen said, looking down and nervously\n      clasping and unclasping her hands, ‘we had such a thunderstorm last\n      Tuesday—I mean one of the last set of Tuesdays, you know.’"
  },
  {
    "id": 766,
    "content": "Alice was puzzled. ‘In our country,’ she remarked, ‘there’s only one day\n      at a time.’"
  },
  {
    "id": 767,
    "content": "The Red Queen said, ‘That’s a poor thin way of doing things. Now here, we\n      mostly have days and nights two or three at a time, and sometimes in the\n      winter we take as many as five nights together—for warmth, you\n      know.’"
  },
  {
    "id": 768,
    "content": "‘Are five nights warmer than one night, then?’ Alice ventured to ask."
  },
  {
    "id": 769,
    "content": "‘Five times as warm, of course.’"
  },
  {
    "id": 770,
    "content": "‘But they should be five times as cold, by the same rule—’"
  },
  {
    "id": 771,
    "content": "‘Just so!’ cried the Red Queen. ‘Five times as warm, and five times as\n      cold—just as I’m five times as rich as you are, and five times as\n      clever!’"
  },
  {
    "id": 772,
    "content": "Alice sighed and gave it up. ‘It’s exactly like a riddle with no answer!’\n      she thought."
  },
  {
    "id": 773,
    "content": "‘Humpty Dumpty saw it too,’ the White Queen went on in a low voice, more\n      as if she were talking to herself. ‘He came to the door with a corkscrew\n      in his hand—’"
  },
  {
    "id": 774,
    "content": "‘What did he want?’ said the Red Queen."
  },
  {
    "id": 775,
    "content": "‘He said he would come in,’ the White Queen went on, ‘because he was\n      looking for a hippopotamus. Now, as it happened, there wasn’t such a thing\n      in the house, that morning.’"
  },
  {
    "id": 776,
    "content": "‘Is there generally?’ Alice asked in an astonished tone."
  },
  {
    "id": 777,
    "content": "‘Well, only on Thursdays,’ said the Queen."
  },
  {
    "id": 778,
    "content": "‘I know what he came for,’ said Alice: ‘he wanted to punish the fish,\n      because—’"
  },
  {
    "id": 779,
    "content": "Here the White Queen began again. ‘It was such a thunderstorm, you can’t\n      think!’ (‘She never could, you know,’ said the Red Queen.) ‘And part of\n      the roof came off, and ever so much thunder got in—and it went\n      rolling round the room in great lumps—and knocking over the tables\n      and things—till I was so frightened, I couldn’t remember my own\n      name!’"
  },
  {
    "id": 780,
    "content": "Alice thought to herself, ‘I never should try to remember my name in the\n      middle of an accident! Where would be the use of it?’ but she did not say\n      this aloud, for fear of hurting the poor Queen’s feeling."
  },
  {
    "id": 781,
    "content": "‘Your Majesty must excuse her,’ the Red Queen said to Alice, taking one of\n      the White Queen’s hands in her own, and gently stroking it: ‘she means\n      well, but she can’t help saying foolish things, as a general rule.’"
  },
  {
    "id": 782,
    "content": "The White Queen looked timidly at Alice, who felt she ought to say\n      something kind, but really couldn’t think of anything at the moment."
  },
  {
    "id": 783,
    "content": "‘She never was really well brought up,’ the Red Queen went on: ‘but it’s\n      amazing how good-tempered she is! Pat her on the head, and see how pleased\n      she’ll be!’ But this was more than Alice had courage to do."
  },
  {
    "id": 784,
    "content": "‘A little kindness—and putting her hair in papers—would do\n      wonders with her—’"
  },
  {
    "id": 785,
    "content": "The White Queen gave a deep sigh, and laid her head on Alice’s shoulder.\n      ‘I am so sleepy?’ she moaned."
  },
  {
    "id": 786,
    "content": "‘She’s tired, poor thing!’ said the Red Queen. ‘Smooth her hair—lend\n      her your nightcap—and sing her a soothing lullaby.’"
  },
  {
    "id": 787,
    "content": "‘I haven’t got a nightcap with me,’ said Alice, as she tried to obey the\n      first direction: ‘and I don’t know any soothing lullabies.’"
  },
  {
    "id": 788,
    "content": "‘I must do it myself, then,’ said the Red Queen, and she began:"
  },
  {
    "id": 789,
    "content": "‘And now you know the words,’ she added, as she put her head down on\n      Alice’s other shoulder, ‘just sing it through to me. I’m getting sleepy,\n      too.’ In another moment both Queens were fast asleep, and snoring loud."
  },
  {
    "id": 790,
    "content": "‘What am I to do?’ exclaimed Alice, looking about in great perplexity, as\n      first one round head, and then the other, rolled down from her shoulder,\n      and lay like a heavy lump in her lap. ‘I don’t think it ever happened\n      before, that any one had to take care of two Queens asleep at once! No,\n      not in all the History of England—it couldn’t, you know, because\n      there never was more than one Queen at a time. Do wake up, you heavy\n      things!’ she went on in an impatient tone; but there was no answer but a\n      gentle snoring."
  },
  {
    "id": 791,
    "content": "The snoring got more distinct every minute, and sounded more like a tune:\n      at last she could even make out the words, and she listened so eagerly\n      that, when the two great heads vanished from her lap, she hardly missed\n      them."
  },
  {
    "id": 792,
    "content": "She was standing before an arched doorway over which were the words QUEEN\n      ALICE in large letters, and on each side of the arch there was a\n      bell-handle; one was marked ‘Visitors’ Bell,’ and the other ‘Servants’\n      Bell.’"
  },
  {
    "id": 793,
    "content": "‘I’ll wait till the song’s over,’ thought Alice, ‘and then I’ll ring—the—which\n      bell must I ring?’ she went on, very much puzzled by the names. ‘I’m not a\n      visitor, and I’m not a servant. There ought to be one marked “Queen,” you\n      know—’"
  },
  {
    "id": 794,
    "content": "Just then the door opened a little way, and a creature with a long beak\n      put its head out for a moment and said ‘No admittance till the week after\n      next!’ and shut the door again with a bang."
  },
  {
    "id": 795,
    "content": "Alice knocked and rang in vain for a long time, but at last, a very old\n      Frog, who was sitting under a tree, got up and hobbled slowly towards her:\n      he was dressed in bright yellow, and had enormous boots on."
  },
  {
    "id": 796,
    "content": "‘What is it, now?’ the Frog said in a deep hoarse whisper."
  },
  {
    "id": 797,
    "content": "Alice turned round, ready to find fault with anybody. ‘Where’s the servant\n      whose business it is to answer the door?’ she began angrily."
  },
  {
    "id": 798,
    "content": "‘Which door?’ said the Frog."
  },
  {
    "id": 799,
    "content": "Alice almost stamped with irritation at the slow drawl in which he spoke.\n      ‘This door, of course!’"
  },
  {
    "id": 800,
    "content": "The Frog looked at the door with his large dull eyes for a minute: then he\n      went nearer and rubbed it with his thumb, as if he were trying whether the\n      paint would come off; then he looked at Alice."
  },
  {
    "id": 801,
    "content": "‘To answer the door?’ he said. ‘What’s it been asking of?’ He was so\n      hoarse that Alice could scarcely hear him."
  },
  {
    "id": 802,
    "content": "‘I don’t know what you mean,’ she said."
  },
  {
    "id": 803,
    "content": "‘I talks English, doesn’t I?’ the Frog went on. ‘Or are you deaf? What did\n      it ask you?’"
  },
  {
    "id": 804,
    "content": "‘Nothing!’ Alice said impatiently. ‘I’ve been knocking at it!’"
  },
  {
    "id": 805,
    "content": "‘Shouldn’t do that—shouldn’t do that—’ the Frog muttered.\n      ‘Vexes it, you know.’ Then he went up and gave the door a kick with one of\n      his great feet. ‘You let it alone,’ he panted out, as he hobbled back to\n      his tree, ‘and it’ll let you alone, you know.’"
  },
  {
    "id": 806,
    "content": "At this moment the door was flung open, and a shrill voice was heard\n      singing:"
  },
  {
    "id": 807,
    "content": "And hundreds of voices joined in the chorus:"
  },
  {
    "id": 808,
    "content": "Then followed a confused noise of cheering, and Alice thought to herself,\n      ‘Thirty times three makes ninety. I wonder if any one’s counting?’ In a\n      minute there was silence again, and the same shrill voice sang another\n      verse;"
  },
  {
    "id": 809,
    "content": "Then came the chorus again:—"
  },
  {
    "id": 810,
    "content": "‘Ninety times nine!’ Alice repeated in despair, ‘Oh, that’ll never be\n      done! I’d better go in at once—’ and there was a dead silence the\n      moment she appeared."
  },
  {
    "id": 811,
    "content": "Alice glanced nervously along the table, as she walked up the large hall,\n      and noticed that there were about fifty guests, of all kinds: some were\n      animals, some birds, and there were even a few flowers among them. ‘I’m\n      glad they’ve come without waiting to be asked,’ she thought: ‘I should\n      never have known who were the right people to invite!’"
  },
  {
    "id": 812,
    "content": "There were three chairs at the head of the table; the Red and White Queens\n      had already taken two of them, but the middle one was empty. Alice sat\n      down in it, rather uncomfortable in the silence, and longing for some one\n      to speak."
  },
  {
    "id": 813,
    "content": "At last the Red Queen began. ‘You’ve missed the soup and fish,’ she said.\n      ‘Put on the joint!’ And the waiters set a leg of mutton before Alice, who\n      looked at it rather anxiously, as she had never had to carve a joint\n      before."
  },
  {
    "id": 814,
    "content": "‘You look a little shy; let me introduce you to that leg of mutton,’ said\n      the Red Queen. ‘Alice—Mutton; Mutton—Alice.’ The leg of mutton\n      got up in the dish and made a little bow to Alice; and Alice returned the\n      bow, not knowing whether to be frightened or amused."
  },
  {
    "id": 815,
    "content": "‘May I give you a slice?’ she said, taking up the knife and fork, and\n      looking from one Queen to the other."
  },
  {
    "id": 816,
    "content": "‘Certainly not,’ the Red Queen said, very decidedly: ‘it isn’t etiquette\n      to cut any one you’ve been introduced to. Remove the joint!’ And the\n      waiters carried it off, and brought a large plum-pudding in its place."
  },
  {
    "id": 817,
    "content": "‘I won’t be introduced to the pudding, please,’ Alice said rather hastily,\n      ‘or we shall get no dinner at all. May I give you some?’"
  },
  {
    "id": 818,
    "content": "But the Red Queen looked sulky, and growled ‘Pudding—Alice; Alice—Pudding.\n      Remove the pudding!’ and the waiters took it away so quickly that Alice\n      couldn’t return its bow."
  },
  {
    "id": 819,
    "content": "However, she didn’t see why the Red Queen should be the only one to give\n      orders, so, as an experiment, she called out ‘Waiter! Bring back the\n      pudding!’ and there it was again in a moment like a conjuring-trick. It\n      was so large that she couldn’t help feeling a little shy with it, as she\n      had been with the mutton; however, she conquered her shyness by a great\n      effort and cut a slice and handed it to the Red Queen."
  },
  {
    "id": 820,
    "content": "‘What impertinence!’ said the Pudding. ‘I wonder how you’d like it, if I\n      were to cut a slice out of you, you creature!’"
  },
  {
    "id": 821,
    "content": "It spoke in a thick, suety sort of voice, and Alice hadn’t a word to say\n      in reply: she could only sit and look at it and gasp."
  },
  {
    "id": 822,
    "content": "‘Make a remark,’ said the Red Queen: ‘it’s ridiculous to leave all the\n      conversation to the pudding!’"
  },
  {
    "id": 823,
    "content": "‘Do you know, I’ve had such a quantity of poetry repeated to me to-day,’\n      Alice began, a little frightened at finding that, the moment she opened\n      her lips, there was dead silence, and all eyes were fixed upon her; ‘and\n      it’s a very curious thing, I think—every poem was about fishes in\n      some way. Do you know why they’re so fond of fishes, all about here?’"
  },
  {
    "id": 824,
    "content": "She spoke to the Red Queen, whose answer was a little wide of the mark.\n      ‘As to fishes,’ she said, very slowly and solemnly, putting her mouth\n      close to Alice’s ear, ‘her White Majesty knows a lovely riddle—all\n      in poetry—all about fishes. Shall she repeat it?’"
  },
  {
    "id": 825,
    "content": "‘Her Red Majesty’s very kind to mention it,’ the White Queen murmured into\n      Alice’s other ear, in a voice like the cooing of a pigeon. ‘It would be\n      such a treat! May I?’"
  },
  {
    "id": 826,
    "content": "‘Please do,’ Alice said very politely."
  },
  {
    "id": 827,
    "content": "The White Queen laughed with delight, and stroked Alice’s cheek. Then she\n      began:"
  },
  {
    "id": 828,
    "content": "‘Take a minute to think about it, and then guess,’ said the Red Queen.\n      ‘Meanwhile, we’ll drink your health—Queen Alice’s health!’ she\n      screamed at the top of her voice, and all the guests began drinking it\n      directly, and very queerly they managed it: some of them put their glasses\n      upon their heads like extinguishers, and drank all that trickled down\n      their faces—others upset the decanters, and drank the wine as it ran\n      off the edges of the table—and three of them (who looked like\n      kangaroos) scrambled into the dish of roast mutton, and began eagerly\n      lapping up the gravy, ‘just like pigs in a trough!’ thought Alice."
  },
  {
    "id": 829,
    "content": "‘You ought to return thanks in a neat speech,’ the Red Queen said,\n      frowning at Alice as she spoke."
  },
  {
    "id": 830,
    "content": "‘We must support you, you know,’ the White Queen whispered, as Alice got\n      up to do it, very obediently, but a little frightened."
  },
  {
    "id": 831,
    "content": "‘Thank you very much,’ she whispered in reply, ‘but I can do quite well\n      without.’"
  },
  {
    "id": 832,
    "content": "‘That wouldn’t be at all the thing,’ the Red Queen said very decidedly: so\n      Alice tried to submit to it with a good grace."
  },
  {
    "id": 833,
    "content": "(‘And they did push so!’ she said afterwards, when she was telling her\n      sister the history of the feast. ‘You would have thought they wanted to\n      squeeze me flat!’)"
  },
  {
    "id": 834,
    "content": "In fact it was rather difficult for her to keep in her place while she\n      made her speech: the two Queens pushed her so, one on each side, that they\n      nearly lifted her up into the air: ‘I rise to return thanks—’ Alice\n      began: and she really did rise as she spoke, several inches; but she got\n      hold of the edge of the table, and managed to pull herself down again."
  },
  {
    "id": 835,
    "content": "‘Take care of yourself!’ screamed the White Queen, seizing Alice’s hair\n      with both her hands. ‘Something’s going to happen!’"
  },
  {
    "id": 836,
    "content": "And then (as Alice afterwards described it) all sorts of things happened\n      in a moment. The candles all grew up to the ceiling, looking something\n      like a bed of rushes with fireworks at the top. As to the bottles, they\n      each took a pair of plates, which they hastily fitted on as wings, and so,\n      with forks for legs, went fluttering about in all directions: ‘and very\n      like birds they look,’ Alice thought to herself, as well as she could in\n      the dreadful confusion that was beginning."
  },
  {
    "id": 837,
    "content": "At this moment she heard a hoarse laugh at her side, and turned to see\n      what was the matter with the White Queen; but, instead of the Queen, there\n      was the leg of mutton sitting in the chair. ‘Here I am!’ cried a voice\n      from the soup tureen, and Alice turned again, just in time to see the\n      Queen’s broad good-natured face grinning at her for a moment over the edge\n      of the tureen, before she disappeared into the soup."
  },
  {
    "id": 838,
    "content": "There was not a moment to be lost. Already several of the guests were\n      lying down in the dishes, and the soup ladle was walking up the table\n      towards Alice’s chair, and beckoning to her impatiently to get out of its\n      way."
  },
  {
    "id": 839,
    "content": "‘I can’t stand this any longer!’ she cried as she jumped up and seized the\n      table-cloth with both hands: one good pull, and plates, dishes, guests,\n      and candles came crashing down together in a heap on the floor."
  },
  {
    "id": 840,
    "content": "‘And as for you,’ she went on, turning fiercely upon the Red Queen, whom\n      she considered as the cause of all the mischief—but the Queen was no\n      longer at her side—she had suddenly dwindled down to the size of a\n      little doll, and was now on the table, merrily running round and round\n      after her own shawl, which was trailing behind her."
  },
  {
    "id": 841,
    "content": "At any other time, Alice would have felt surprised at this, but she was\n      far too much excited to be surprised at anything now. ‘As for you,’ she\n      repeated, catching hold of the little creature in the very act of jumping\n      over a bottle which had just lighted upon the table, ‘I’ll shake you into\n      a kitten, that I will!’"
  },
  {
    "id": 842,
    "content": "She took her off the table as she spoke, and shook her backwards and\n      forwards with all her might."
  },
  {
    "id": 843,
    "content": "The Red Queen made no resistance whatever; only her face grew very small,\n      and her eyes got large and green: and still, as Alice went on shaking her,\n      she kept on growing shorter—and fatter—and softer—and\n      rounder—and—"
  },
  {
    "id": 844,
    "content": "—and it really was a kitten, after all."
  },
  {
    "id": 845,
    "content": "‘Your majesty shouldn’t purr so loud,’ Alice said, rubbing her eyes, and\n      addressing the kitten, respectfully, yet with some severity. ‘You woke me\n      out of oh! such a nice dream! And you’ve been along with me, Kitty—all\n      through the Looking-Glass world. Did you know it, dear?’"
  },
  {
    "id": 846,
    "content": "It is a very inconvenient habit of kittens (Alice had once made the\n      remark) that, whatever you say to them, they always purr. ‘If they would\n      only purr for “yes” and mew for “no,” or any rule of that sort,’ she had\n      said, ‘so that one could keep up a conversation! But how can you talk with\n      a person if they always say the same thing?’"
  },
  {
    "id": 847,
    "content": "On this occasion the kitten only purred: and it was impossible to guess\n      whether it meant ‘yes’ or ‘no.’"
  },
  {
    "id": 848,
    "content": "So Alice hunted among the chessmen on the table till she had found the Red\n      Queen: then she went down on her knees on the hearth-rug, and put the\n      kitten and the Queen to look at each other. ‘Now, Kitty!’ she cried,\n      clapping her hands triumphantly. ‘Confess that was what you turned into!’"
  },
  {
    "id": 849,
    "content": "(‘But it wouldn’t look at it,’ she said, when she was explaining the thing\n      afterwards to her sister: ‘it turned away its head, and pretended not to\n      see it: but it looked a little ashamed of itself, so I think it must have\n      been the Red Queen.’)"
  },
  {
    "id": 850,
    "content": "‘Sit up a little more stiffly, dear!’ Alice cried with a merry laugh. ‘And\n      curtsey while you’re thinking what to—what to purr. It saves time,\n      remember!’ And she caught it up and gave it one little kiss, ‘just in\n      honour of having been a Red Queen.’"
  },
  {
    "id": 851,
    "content": "‘Snowdrop, my pet!’ she went on, looking over her shoulder at the White\n      Kitten, which was still patiently undergoing its toilet, ‘when will Dinah\n      have finished with your White Majesty, I wonder? That must be the reason\n      you were so untidy in my dream—Dinah! do you know that you’re\n      scrubbing a White Queen? Really, it’s most disrespectful of you!"
  },
  {
    "id": 852,
    "content": "‘And what did Dinah turn to, I wonder?’ she prattled on, as she settled\n      comfortably down, with one elbow in the rug, and her chin in her hand, to\n      watch the kittens. ‘Tell me, Dinah, did you turn to Humpty Dumpty? I think\n      you did—however, you’d better not mention it to your friends just\n      yet, for I’m not sure."
  },
  {
    "id": 853,
    "content": "‘By the way, Kitty, if only you’d been really with me in my dream, there\n      was one thing you would have enjoyed—I had such a quantity of poetry\n      said to me, all about fishes! To-morrow morning you shall have a real\n      treat. All the time you’re eating your breakfast, I’ll repeat “The Walrus\n      and the Carpenter” to you; and then you can make believe it’s oysters,\n      dear!"
  },
  {
    "id": 854,
    "content": "‘Now, Kitty, let’s consider who it was that dreamed it all. This is a\n      serious question, my dear, and you should not go on licking your paw like\n      that—as if Dinah hadn’t washed you this morning! You see, Kitty, it\n      must have been either me or the Red King. He was part of my dream, of\n      course—but then I was part of his dream, too! Was it the Red King,\n      Kitty? You were his wife, my dear, so you ought to know—Oh, Kitty,\n      do help to settle it! I’m sure your paw can wait!’ But the provoking\n      kitten only began on the other paw, and pretended it hadn’t heard the\n      question."
  },
  {
    "id": 855,
    "content": "Which do you think it was?"
  }
]
